/* automatically generated by rust-bindgen 0.56.0 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const __BITS_PER_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const SI_LOAD_SHIFT: u32 = 16;
pub const _K_SS_MAXSIZE: u32 = 128;
pub const NETLINK_ROUTE: u32 = 0;
pub const NETLINK_UNUSED: u32 = 1;
pub const NETLINK_USERSOCK: u32 = 2;
pub const NETLINK_FIREWALL: u32 = 3;
pub const NETLINK_SOCK_DIAG: u32 = 4;
pub const NETLINK_NFLOG: u32 = 5;
pub const NETLINK_XFRM: u32 = 6;
pub const NETLINK_SELINUX: u32 = 7;
pub const NETLINK_ISCSI: u32 = 8;
pub const NETLINK_AUDIT: u32 = 9;

pub const RTPROT_BOOT: u32 = 3;
pub const RTPROT_STATIC: u32 = 4;
pub const RTPROT_GATED: u32 = 8;
pub const RTPROT_RA: u32 = 9;
pub const RTPROT_MRT: u32 = 10;
pub const RTPROT_ZEBRA: u32 = 11;
pub const RTPROT_BIRD: u32 = 12;
pub const RTPROT_DNROUTED: u32 = 13;
pub const RTPROT_XORP: u32 = 14;
pub const RTPROT_NTK: u32 = 15;
pub const RTPROT_DHCP: u32 = 16;
pub const RTPROT_MROUTED: u32 = 17;
pub const RTPROT_KEEPALIVED: u32 = 18;
pub const RTPROT_BABEL: u32 = 42;
pub const RTPROT_BGP: u32 = 186;
pub const RTPROT_ISIS: u32 = 187;
pub const RTPROT_OSPF: u32 = 188;
pub const RTPROT_RIP: u32 = 189;
pub const RTPROT_EIGRP: u32 = 192;
pub const RTM_F_NOTIFY: u32 = 256;
pub const RTM_F_CLONED: u32 = 512;
pub const RTM_F_EQUALIZE: u32 = 1024;
pub const RTM_F_PREFIX: u32 = 2048;
pub const RTM_F_LOOKUP_TABLE: u32 = 4096;
pub const RTM_F_FIB_MATCH: u32 = 8192;
pub const RTM_F_OFFLOAD: u32 = 16384;
pub const RTM_F_TRAP: u32 = 32768;
pub const RTNH_F_DEAD: u32 = 1;
pub const RTNH_F_PERVASIVE: u32 = 2;
pub const RTNH_F_ONLINK: u32 = 4;
pub const RTNH_F_OFFLOAD: u32 = 8;
pub const RTNH_F_LINKDOWN: u32 = 16;
pub const RTNH_F_UNRESOLVED: u32 = 32;
pub const RTNH_COMPARE_MASK: u32 = 25;
pub const RTNH_ALIGNTO: u32 = 4;
pub const RTNETLINK_HAVE_PEERINFO: u32 = 1;
pub const RTAX_FEATURE_ECN: u32 = 1;
pub const RTAX_FEATURE_SACK: u32 = 2;
pub const RTAX_FEATURE_TIMESTAMP: u32 = 4;
pub const RTAX_FEATURE_ALLFRAG: u32 = 8;
pub const RTAX_FEATURE_MASK: u32 = 15;
pub const TCM_IFINDEX_MAGIC_BLOCK: u32 = 4294967295;
pub const TCA_DUMP_FLAGS_TERSE: u32 = 1;
pub const RTMGRP_LINK: u32 = 1;
pub const RTMGRP_NOTIFY: u32 = 2;
pub const RTMGRP_NEIGH: u32 = 4;
pub const RTMGRP_TC: u32 = 8;
pub const RTMGRP_IPV4_IFADDR: u32 = 16;
pub const RTMGRP_IPV4_MROUTE: u32 = 32;
pub const RTMGRP_IPV4_ROUTE: u32 = 64;
pub const RTMGRP_IPV4_RULE: u32 = 128;
pub const RTMGRP_IPV6_IFADDR: u32 = 256;
pub const RTMGRP_IPV6_MROUTE: u32 = 512;
pub const RTMGRP_IPV6_ROUTE: u32 = 1024;
pub const RTMGRP_IPV6_IFINFO: u32 = 2048;
pub const RTMGRP_DECnet_IFADDR: u32 = 4096;
pub const RTMGRP_DECnet_ROUTE: u32 = 16384;
pub const RTMGRP_IPV6_PREFIX: u32 = 131072;
pub const TCA_FLAG_LARGE_DUMP_ON: u32 = 1;
pub const RTEXT_FILTER_VF: u32 = 1;
pub const RTEXT_FILTER_BRVLAN: u32 = 2;
pub const RTEXT_FILTER_BRVLAN_COMPRESSED: u32 = 4;
pub const RTEXT_FILTER_SKIP_STATS: u32 = 8;
pub const RTEXT_FILTER_MRP: u32 = 16;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fsid_t>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug)]
pub struct sysinfo {
    pub uptime: __kernel_long_t,
    pub loads: [__kernel_ulong_t; 3usize],
    pub totalram: __kernel_ulong_t,
    pub freeram: __kernel_ulong_t,
    pub sharedram: __kernel_ulong_t,
    pub bufferram: __kernel_ulong_t,
    pub totalswap: __kernel_ulong_t,
    pub freeswap: __kernel_ulong_t,
    pub procs: __u16,
    pub pad: __u16,
    pub totalhigh: __kernel_ulong_t,
    pub freehigh: __kernel_ulong_t,
    pub mem_unit: __u32,
    pub _f: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sysinfo() {
    assert_eq!(
        ::std::mem::size_of::<sysinfo>(),
        112usize,
        concat!("Size of: ", stringify!(sysinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<sysinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(sysinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).uptime as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(uptime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).loads as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(loads)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).totalram as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(totalram)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).freeram as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(freeram)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).sharedram as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(sharedram)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).bufferram as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(bufferram)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).totalswap as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(totalswap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).freeswap as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(freeswap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).procs as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(procs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).pad as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).totalhigh as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(totalhigh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).freehigh as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(freehigh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>())).mem_unit as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(mem_unit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sysinfo>()))._f as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(sysinfo),
            "::",
            stringify!(_f)
        )
    );
}
pub type __kernel_sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __kernel_sockaddr_storage {
    pub __bindgen_anon_1: __kernel_sockaddr_storage__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __kernel_sockaddr_storage__bindgen_ty_1 {
    pub __bindgen_anon_1: __kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1,
    pub __align: *mut ::std::os::raw::c_void,
    _bindgen_union_align: [u64; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1 {
    pub ss_family: __kernel_sa_family_t,
    pub __data: [::std::os::raw::c_char; 126usize],
}
#[test]
fn bindgen_test_layout___kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1>()))
                .ss_family as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1>())).__data
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__data)
        )
    );
}
#[test]
fn bindgen_test_layout___kernel_sockaddr_storage__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_sockaddr_storage__bindgen_ty_1>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_sockaddr_storage__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__kernel_sockaddr_storage__bindgen_ty_1>())).__align as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_sockaddr_storage__bindgen_ty_1),
            "::",
            stringify!(__align)
        )
    );
}
#[test]
fn bindgen_test_layout___kernel_sockaddr_storage() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_sockaddr_storage))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_nl {
    pub nl_family: __kernel_sa_family_t,
    pub nl_pad: ::std::os::raw::c_ushort,
    pub nl_pid: __u32,
    pub nl_groups: __u32,
}
#[test]
fn bindgen_test_layout_sockaddr_nl() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_nl>(),
        12usize,
        concat!("Size of: ", stringify!(sockaddr_nl))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_nl>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_nl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_nl>())).nl_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_nl),
            "::",
            stringify!(nl_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_nl>())).nl_pad as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_nl),
            "::",
            stringify!(nl_pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_nl>())).nl_pid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_nl),
            "::",
            stringify!(nl_pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_nl>())).nl_groups as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_nl),
            "::",
            stringify!(nl_groups)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nlmsghdr {
    pub nlmsg_len: __u32,
    pub nlmsg_type: __u16,
    pub nlmsg_flags: __u16,
    pub nlmsg_seq: __u32,
    pub nlmsg_pid: __u32,
}
#[test]
fn bindgen_test_layout_nlmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<nlmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(nlmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<nlmsghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(nlmsghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsghdr>())).nlmsg_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsghdr),
            "::",
            stringify!(nlmsg_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsghdr>())).nlmsg_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsghdr),
            "::",
            stringify!(nlmsg_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsghdr>())).nlmsg_flags as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsghdr),
            "::",
            stringify!(nlmsg_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsghdr>())).nlmsg_seq as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsghdr),
            "::",
            stringify!(nlmsg_seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsghdr>())).nlmsg_pid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsghdr),
            "::",
            stringify!(nlmsg_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nlmsgerr {
    pub error: ::std::os::raw::c_int,
    pub msg: nlmsghdr,
}
#[test]
fn bindgen_test_layout_nlmsgerr() {
    assert_eq!(
        ::std::mem::size_of::<nlmsgerr>(),
        20usize,
        concat!("Size of: ", stringify!(nlmsgerr))
    );
    assert_eq!(
        ::std::mem::align_of::<nlmsgerr>(),
        4usize,
        concat!("Alignment of ", stringify!(nlmsgerr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsgerr>())).error as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsgerr),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlmsgerr>())).msg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nlmsgerr),
            "::",
            stringify!(msg)
        )
    );
}
pub const nlmsgerr_attrs_NLMSGERR_ATTR_UNUSED: nlmsgerr_attrs = 0;
pub const nlmsgerr_attrs_NLMSGERR_ATTR_MSG: nlmsgerr_attrs = 1;
pub const nlmsgerr_attrs_NLMSGERR_ATTR_OFFS: nlmsgerr_attrs = 2;
pub const nlmsgerr_attrs_NLMSGERR_ATTR_COOKIE: nlmsgerr_attrs = 3;
pub const nlmsgerr_attrs___NLMSGERR_ATTR_MAX: nlmsgerr_attrs = 4;
pub const nlmsgerr_attrs_NLMSGERR_ATTR_MAX: nlmsgerr_attrs = 3;
pub type nlmsgerr_attrs = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nl_pktinfo {
    pub group: __u32,
}
#[test]
fn bindgen_test_layout_nl_pktinfo() {
    assert_eq!(
        ::std::mem::size_of::<nl_pktinfo>(),
        4usize,
        concat!("Size of: ", stringify!(nl_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<nl_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(nl_pktinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_pktinfo>())).group as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_pktinfo),
            "::",
            stringify!(group)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nl_mmap_req {
    pub nm_block_size: ::std::os::raw::c_uint,
    pub nm_block_nr: ::std::os::raw::c_uint,
    pub nm_frame_size: ::std::os::raw::c_uint,
    pub nm_frame_nr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_nl_mmap_req() {
    assert_eq!(
        ::std::mem::size_of::<nl_mmap_req>(),
        16usize,
        concat!("Size of: ", stringify!(nl_mmap_req))
    );
    assert_eq!(
        ::std::mem::align_of::<nl_mmap_req>(),
        4usize,
        concat!("Alignment of ", stringify!(nl_mmap_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_req>())).nm_block_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_req),
            "::",
            stringify!(nm_block_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_req>())).nm_block_nr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_req),
            "::",
            stringify!(nm_block_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_req>())).nm_frame_size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_req),
            "::",
            stringify!(nm_frame_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_req>())).nm_frame_nr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_req),
            "::",
            stringify!(nm_frame_nr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nl_mmap_hdr {
    pub nm_status: ::std::os::raw::c_uint,
    pub nm_len: ::std::os::raw::c_uint,
    pub nm_group: __u32,
    pub nm_pid: __u32,
    pub nm_uid: __u32,
    pub nm_gid: __u32,
}
#[test]
fn bindgen_test_layout_nl_mmap_hdr() {
    assert_eq!(
        ::std::mem::size_of::<nl_mmap_hdr>(),
        24usize,
        concat!("Size of: ", stringify!(nl_mmap_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<nl_mmap_hdr>(),
        4usize,
        concat!("Alignment of ", stringify!(nl_mmap_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_pid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_uid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nl_mmap_hdr>())).nm_gid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nl_mmap_hdr),
            "::",
            stringify!(nm_gid)
        )
    );
}
pub const nl_mmap_status_NL_MMAP_STATUS_UNUSED: nl_mmap_status = 0;
pub const nl_mmap_status_NL_MMAP_STATUS_RESERVED: nl_mmap_status = 1;
pub const nl_mmap_status_NL_MMAP_STATUS_VALID: nl_mmap_status = 2;
pub const nl_mmap_status_NL_MMAP_STATUS_COPY: nl_mmap_status = 3;
pub const nl_mmap_status_NL_MMAP_STATUS_SKIP: nl_mmap_status = 4;
pub type nl_mmap_status = ::std::os::raw::c_uint;
pub const NETLINK_UNCONNECTED: ::std::os::raw::c_uint = 0;
pub const NETLINK_CONNECTED: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nlattr {
    pub nla_len: __u16,
    pub nla_type: __u16,
}
#[test]
fn bindgen_test_layout_nlattr() {
    assert_eq!(
        ::std::mem::size_of::<nlattr>(),
        4usize,
        concat!("Size of: ", stringify!(nlattr))
    );
    assert_eq!(
        ::std::mem::align_of::<nlattr>(),
        2usize,
        concat!("Alignment of ", stringify!(nlattr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlattr>())).nla_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nlattr),
            "::",
            stringify!(nla_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nlattr>())).nla_type as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nlattr),
            "::",
            stringify!(nla_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nla_bitfield32 {
    pub value: __u32,
    pub selector: __u32,
}
#[test]
fn bindgen_test_layout_nla_bitfield32() {
    assert_eq!(
        ::std::mem::size_of::<nla_bitfield32>(),
        8usize,
        concat!("Size of: ", stringify!(nla_bitfield32))
    );
    assert_eq!(
        ::std::mem::align_of::<nla_bitfield32>(),
        4usize,
        concat!("Alignment of ", stringify!(nla_bitfield32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nla_bitfield32>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nla_bitfield32),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nla_bitfield32>())).selector as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nla_bitfield32),
            "::",
            stringify!(selector)
        )
    );
}
pub const netlink_attribute_type_NL_ATTR_TYPE_INVALID: netlink_attribute_type = 0;
pub const netlink_attribute_type_NL_ATTR_TYPE_FLAG: netlink_attribute_type = 1;
pub const netlink_attribute_type_NL_ATTR_TYPE_U8: netlink_attribute_type = 2;
pub const netlink_attribute_type_NL_ATTR_TYPE_U16: netlink_attribute_type = 3;
pub const netlink_attribute_type_NL_ATTR_TYPE_U32: netlink_attribute_type = 4;
pub const netlink_attribute_type_NL_ATTR_TYPE_U64: netlink_attribute_type = 5;
pub const netlink_attribute_type_NL_ATTR_TYPE_S8: netlink_attribute_type = 6;
pub const netlink_attribute_type_NL_ATTR_TYPE_S16: netlink_attribute_type = 7;
pub const netlink_attribute_type_NL_ATTR_TYPE_S32: netlink_attribute_type = 8;
pub const netlink_attribute_type_NL_ATTR_TYPE_S64: netlink_attribute_type = 9;
pub const netlink_attribute_type_NL_ATTR_TYPE_BINARY: netlink_attribute_type = 10;
pub const netlink_attribute_type_NL_ATTR_TYPE_STRING: netlink_attribute_type = 11;
pub const netlink_attribute_type_NL_ATTR_TYPE_NUL_STRING: netlink_attribute_type = 12;
pub const netlink_attribute_type_NL_ATTR_TYPE_NESTED: netlink_attribute_type = 13;
pub const netlink_attribute_type_NL_ATTR_TYPE_NESTED_ARRAY: netlink_attribute_type = 14;
pub const netlink_attribute_type_NL_ATTR_TYPE_BITFIELD32: netlink_attribute_type = 15;
pub type netlink_attribute_type = ::std::os::raw::c_uint;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_UNSPEC: netlink_policy_type_attr = 0;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_TYPE: netlink_policy_type_attr = 1;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MIN_VALUE_S: netlink_policy_type_attr = 2;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MAX_VALUE_S: netlink_policy_type_attr = 3;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MIN_VALUE_U: netlink_policy_type_attr = 4;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MAX_VALUE_U: netlink_policy_type_attr = 5;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MIN_LENGTH: netlink_policy_type_attr = 6;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MAX_LENGTH: netlink_policy_type_attr = 7;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_POLICY_IDX: netlink_policy_type_attr = 8;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_POLICY_MAXTYPE: netlink_policy_type_attr = 9;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_BITFIELD32_MASK: netlink_policy_type_attr =
    10;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_PAD: netlink_policy_type_attr = 11;
pub const netlink_policy_type_attr___NL_POLICY_TYPE_ATTR_MAX: netlink_policy_type_attr = 12;
pub const netlink_policy_type_attr_NL_POLICY_TYPE_ATTR_MAX: netlink_policy_type_attr = 11;
pub type netlink_policy_type_attr = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtnl_link_stats {
    pub rx_packets: __u32,
    pub tx_packets: __u32,
    pub rx_bytes: __u32,
    pub tx_bytes: __u32,
    pub rx_errors: __u32,
    pub tx_errors: __u32,
    pub rx_dropped: __u32,
    pub tx_dropped: __u32,
    pub multicast: __u32,
    pub collisions: __u32,
    pub rx_length_errors: __u32,
    pub rx_over_errors: __u32,
    pub rx_crc_errors: __u32,
    pub rx_frame_errors: __u32,
    pub rx_fifo_errors: __u32,
    pub rx_missed_errors: __u32,
    pub tx_aborted_errors: __u32,
    pub tx_carrier_errors: __u32,
    pub tx_fifo_errors: __u32,
    pub tx_heartbeat_errors: __u32,
    pub tx_window_errors: __u32,
    pub rx_compressed: __u32,
    pub tx_compressed: __u32,
    pub rx_nohandler: __u32,
}
#[test]
fn bindgen_test_layout_rtnl_link_stats() {
    assert_eq!(
        ::std::mem::size_of::<rtnl_link_stats>(),
        96usize,
        concat!("Size of: ", stringify!(rtnl_link_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<rtnl_link_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(rtnl_link_stats))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_packets as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_packets as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_bytes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_bytes as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_errors as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_errors as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_dropped as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_dropped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_dropped as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_dropped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).multicast as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(multicast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).collisions as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(collisions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).rx_length_errors as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_length_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_over_errors as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_over_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_crc_errors as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_crc_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_frame_errors as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_frame_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_fifo_errors as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_fifo_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).rx_missed_errors as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_missed_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).tx_aborted_errors as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_aborted_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).tx_carrier_errors as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_carrier_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_fifo_errors as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_fifo_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).tx_heartbeat_errors as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_heartbeat_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats>())).tx_window_errors as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_window_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_compressed as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_compressed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).tx_compressed as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(tx_compressed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats>())).rx_nohandler as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats),
            "::",
            stringify!(rx_nohandler)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtnl_link_stats64 {
    pub rx_packets: __u64,
    pub tx_packets: __u64,
    pub rx_bytes: __u64,
    pub tx_bytes: __u64,
    pub rx_errors: __u64,
    pub tx_errors: __u64,
    pub rx_dropped: __u64,
    pub tx_dropped: __u64,
    pub multicast: __u64,
    pub collisions: __u64,
    pub rx_length_errors: __u64,
    pub rx_over_errors: __u64,
    pub rx_crc_errors: __u64,
    pub rx_frame_errors: __u64,
    pub rx_fifo_errors: __u64,
    pub rx_missed_errors: __u64,
    pub tx_aborted_errors: __u64,
    pub tx_carrier_errors: __u64,
    pub tx_fifo_errors: __u64,
    pub tx_heartbeat_errors: __u64,
    pub tx_window_errors: __u64,
    pub rx_compressed: __u64,
    pub tx_compressed: __u64,
    pub rx_nohandler: __u64,
}
#[test]
fn bindgen_test_layout_rtnl_link_stats64() {
    assert_eq!(
        ::std::mem::size_of::<rtnl_link_stats64>(),
        192usize,
        concat!("Size of: ", stringify!(rtnl_link_stats64))
    );
    assert_eq!(
        ::std::mem::align_of::<rtnl_link_stats64>(),
        8usize,
        concat!("Alignment of ", stringify!(rtnl_link_stats64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_packets as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_packets as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_bytes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_bytes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_errors as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_errors as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_dropped as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_dropped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_dropped as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_dropped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).multicast as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(multicast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).collisions as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(collisions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_length_errors as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_length_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_over_errors as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_over_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_crc_errors as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_crc_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_frame_errors as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_frame_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_fifo_errors as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_fifo_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_missed_errors as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_missed_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_aborted_errors as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_aborted_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_carrier_errors as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_carrier_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_fifo_errors as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_fifo_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_heartbeat_errors as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_heartbeat_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_window_errors as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_window_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_compressed as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_compressed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).tx_compressed as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(tx_compressed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_stats64>())).rx_nohandler as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_stats64),
            "::",
            stringify!(rx_nohandler)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtnl_link_ifmap {
    pub mem_start: __u64,
    pub mem_end: __u64,
    pub base_addr: __u64,
    pub irq: __u16,
    pub dma: __u8,
    pub port: __u8,
}
#[test]
fn bindgen_test_layout_rtnl_link_ifmap() {
    assert_eq!(
        ::std::mem::size_of::<rtnl_link_ifmap>(),
        32usize,
        concat!("Size of: ", stringify!(rtnl_link_ifmap))
    );
    assert_eq!(
        ::std::mem::align_of::<rtnl_link_ifmap>(),
        8usize,
        concat!("Alignment of ", stringify!(rtnl_link_ifmap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).mem_start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(mem_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).mem_end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(mem_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).base_addr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(base_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).irq as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).dma as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(dma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnl_link_ifmap>())).port as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnl_link_ifmap),
            "::",
            stringify!(port)
        )
    );
}
pub const IFLA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_ADDRESS: ::std::os::raw::c_uint = 1;
pub const IFLA_BROADCAST: ::std::os::raw::c_uint = 2;
pub const IFLA_IFNAME: ::std::os::raw::c_uint = 3;
pub const IFLA_MTU: ::std::os::raw::c_uint = 4;
pub const IFLA_LINK: ::std::os::raw::c_uint = 5;
pub const IFLA_QDISC: ::std::os::raw::c_uint = 6;
pub const IFLA_STATS: ::std::os::raw::c_uint = 7;
pub const IFLA_COST: ::std::os::raw::c_uint = 8;
pub const IFLA_PRIORITY: ::std::os::raw::c_uint = 9;
pub const IFLA_MASTER: ::std::os::raw::c_uint = 10;
pub const IFLA_WIRELESS: ::std::os::raw::c_uint = 11;
pub const IFLA_PROTINFO: ::std::os::raw::c_uint = 12;
pub const IFLA_TXQLEN: ::std::os::raw::c_uint = 13;
pub const IFLA_MAP: ::std::os::raw::c_uint = 14;
pub const IFLA_WEIGHT: ::std::os::raw::c_uint = 15;
pub const IFLA_OPERSTATE: ::std::os::raw::c_uint = 16;
pub const IFLA_LINKMODE: ::std::os::raw::c_uint = 17;
pub const IFLA_LINKINFO: ::std::os::raw::c_uint = 18;
pub const IFLA_NET_NS_PID: ::std::os::raw::c_uint = 19;
pub const IFLA_IFALIAS: ::std::os::raw::c_uint = 20;
pub const IFLA_NUM_VF: ::std::os::raw::c_uint = 21;
pub const IFLA_VFINFO_LIST: ::std::os::raw::c_uint = 22;
pub const IFLA_STATS64: ::std::os::raw::c_uint = 23;
pub const IFLA_VF_PORTS: ::std::os::raw::c_uint = 24;
pub const IFLA_PORT_SELF: ::std::os::raw::c_uint = 25;
pub const IFLA_AF_SPEC: ::std::os::raw::c_uint = 26;
pub const IFLA_GROUP: ::std::os::raw::c_uint = 27;
pub const IFLA_NET_NS_FD: ::std::os::raw::c_uint = 28;
pub const IFLA_EXT_MASK: ::std::os::raw::c_uint = 29;
pub const IFLA_PROMISCUITY: ::std::os::raw::c_uint = 30;
pub const IFLA_NUM_TX_QUEUES: ::std::os::raw::c_uint = 31;
pub const IFLA_NUM_RX_QUEUES: ::std::os::raw::c_uint = 32;
pub const IFLA_CARRIER: ::std::os::raw::c_uint = 33;
pub const IFLA_PHYS_PORT_ID: ::std::os::raw::c_uint = 34;
pub const IFLA_CARRIER_CHANGES: ::std::os::raw::c_uint = 35;
pub const IFLA_PHYS_SWITCH_ID: ::std::os::raw::c_uint = 36;
pub const IFLA_LINK_NETNSID: ::std::os::raw::c_uint = 37;
pub const IFLA_PHYS_PORT_NAME: ::std::os::raw::c_uint = 38;
pub const IFLA_PROTO_DOWN: ::std::os::raw::c_uint = 39;
pub const IFLA_GSO_MAX_SEGS: ::std::os::raw::c_uint = 40;
pub const IFLA_GSO_MAX_SIZE: ::std::os::raw::c_uint = 41;
pub const IFLA_PAD: ::std::os::raw::c_uint = 42;
pub const IFLA_XDP: ::std::os::raw::c_uint = 43;
pub const IFLA_EVENT: ::std::os::raw::c_uint = 44;
pub const IFLA_NEW_NETNSID: ::std::os::raw::c_uint = 45;
pub const IFLA_IF_NETNSID: ::std::os::raw::c_uint = 46;
pub const IFLA_TARGET_NETNSID: ::std::os::raw::c_uint = 46;
pub const IFLA_CARRIER_UP_COUNT: ::std::os::raw::c_uint = 47;
pub const IFLA_CARRIER_DOWN_COUNT: ::std::os::raw::c_uint = 48;
pub const IFLA_NEW_IFINDEX: ::std::os::raw::c_uint = 49;
pub const IFLA_MIN_MTU: ::std::os::raw::c_uint = 50;
pub const IFLA_MAX_MTU: ::std::os::raw::c_uint = 51;
pub const IFLA_PROP_LIST: ::std::os::raw::c_uint = 52;
pub const IFLA_ALT_IFNAME: ::std::os::raw::c_uint = 53;
pub const IFLA_PERM_ADDRESS: ::std::os::raw::c_uint = 54;
pub const IFLA_PROTO_DOWN_REASON: ::std::os::raw::c_uint = 55;
pub const __IFLA_MAX: ::std::os::raw::c_uint = 56;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const IFLA_PROTO_DOWN_REASON_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_PROTO_DOWN_REASON_MASK: ::std::os::raw::c_uint = 1;
pub const IFLA_PROTO_DOWN_REASON_VALUE: ::std::os::raw::c_uint = 2;
pub const __IFLA_PROTO_DOWN_REASON_CNT: ::std::os::raw::c_uint = 3;
pub const IFLA_PROTO_DOWN_REASON_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const IFLA_INET_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_INET_CONF: ::std::os::raw::c_uint = 1;
pub const __IFLA_INET_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const IFLA_INET6_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_INET6_FLAGS: ::std::os::raw::c_uint = 1;
pub const IFLA_INET6_CONF: ::std::os::raw::c_uint = 2;
pub const IFLA_INET6_STATS: ::std::os::raw::c_uint = 3;
pub const IFLA_INET6_MCAST: ::std::os::raw::c_uint = 4;
pub const IFLA_INET6_CACHEINFO: ::std::os::raw::c_uint = 5;
pub const IFLA_INET6_ICMP6STATS: ::std::os::raw::c_uint = 6;
pub const IFLA_INET6_TOKEN: ::std::os::raw::c_uint = 7;
pub const IFLA_INET6_ADDR_GEN_MODE: ::std::os::raw::c_uint = 8;
pub const __IFLA_INET6_MAX: ::std::os::raw::c_uint = 9;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const in6_addr_gen_mode_IN6_ADDR_GEN_MODE_EUI64: in6_addr_gen_mode = 0;
pub const in6_addr_gen_mode_IN6_ADDR_GEN_MODE_NONE: in6_addr_gen_mode = 1;
pub const in6_addr_gen_mode_IN6_ADDR_GEN_MODE_STABLE_PRIVACY: in6_addr_gen_mode = 2;
pub const in6_addr_gen_mode_IN6_ADDR_GEN_MODE_RANDOM: in6_addr_gen_mode = 3;
pub type in6_addr_gen_mode = ::std::os::raw::c_uint;
pub const IFLA_BR_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BR_FORWARD_DELAY: ::std::os::raw::c_uint = 1;
pub const IFLA_BR_HELLO_TIME: ::std::os::raw::c_uint = 2;
pub const IFLA_BR_MAX_AGE: ::std::os::raw::c_uint = 3;
pub const IFLA_BR_AGEING_TIME: ::std::os::raw::c_uint = 4;
pub const IFLA_BR_STP_STATE: ::std::os::raw::c_uint = 5;
pub const IFLA_BR_PRIORITY: ::std::os::raw::c_uint = 6;
pub const IFLA_BR_VLAN_FILTERING: ::std::os::raw::c_uint = 7;
pub const IFLA_BR_VLAN_PROTOCOL: ::std::os::raw::c_uint = 8;
pub const IFLA_BR_GROUP_FWD_MASK: ::std::os::raw::c_uint = 9;
pub const IFLA_BR_ROOT_ID: ::std::os::raw::c_uint = 10;
pub const IFLA_BR_BRIDGE_ID: ::std::os::raw::c_uint = 11;
pub const IFLA_BR_ROOT_PORT: ::std::os::raw::c_uint = 12;
pub const IFLA_BR_ROOT_PATH_COST: ::std::os::raw::c_uint = 13;
pub const IFLA_BR_TOPOLOGY_CHANGE: ::std::os::raw::c_uint = 14;
pub const IFLA_BR_TOPOLOGY_CHANGE_DETECTED: ::std::os::raw::c_uint = 15;
pub const IFLA_BR_HELLO_TIMER: ::std::os::raw::c_uint = 16;
pub const IFLA_BR_TCN_TIMER: ::std::os::raw::c_uint = 17;
pub const IFLA_BR_TOPOLOGY_CHANGE_TIMER: ::std::os::raw::c_uint = 18;
pub const IFLA_BR_GC_TIMER: ::std::os::raw::c_uint = 19;
pub const IFLA_BR_GROUP_ADDR: ::std::os::raw::c_uint = 20;
pub const IFLA_BR_FDB_FLUSH: ::std::os::raw::c_uint = 21;
pub const IFLA_BR_MCAST_ROUTER: ::std::os::raw::c_uint = 22;
pub const IFLA_BR_MCAST_SNOOPING: ::std::os::raw::c_uint = 23;
pub const IFLA_BR_MCAST_QUERY_USE_IFADDR: ::std::os::raw::c_uint = 24;
pub const IFLA_BR_MCAST_QUERIER: ::std::os::raw::c_uint = 25;
pub const IFLA_BR_MCAST_HASH_ELASTICITY: ::std::os::raw::c_uint = 26;
pub const IFLA_BR_MCAST_HASH_MAX: ::std::os::raw::c_uint = 27;
pub const IFLA_BR_MCAST_LAST_MEMBER_CNT: ::std::os::raw::c_uint = 28;
pub const IFLA_BR_MCAST_STARTUP_QUERY_CNT: ::std::os::raw::c_uint = 29;
pub const IFLA_BR_MCAST_LAST_MEMBER_INTVL: ::std::os::raw::c_uint = 30;
pub const IFLA_BR_MCAST_MEMBERSHIP_INTVL: ::std::os::raw::c_uint = 31;
pub const IFLA_BR_MCAST_QUERIER_INTVL: ::std::os::raw::c_uint = 32;
pub const IFLA_BR_MCAST_QUERY_INTVL: ::std::os::raw::c_uint = 33;
pub const IFLA_BR_MCAST_QUERY_RESPONSE_INTVL: ::std::os::raw::c_uint = 34;
pub const IFLA_BR_MCAST_STARTUP_QUERY_INTVL: ::std::os::raw::c_uint = 35;
pub const IFLA_BR_NF_CALL_IPTABLES: ::std::os::raw::c_uint = 36;
pub const IFLA_BR_NF_CALL_IP6TABLES: ::std::os::raw::c_uint = 37;
pub const IFLA_BR_NF_CALL_ARPTABLES: ::std::os::raw::c_uint = 38;
pub const IFLA_BR_VLAN_DEFAULT_PVID: ::std::os::raw::c_uint = 39;
pub const IFLA_BR_PAD: ::std::os::raw::c_uint = 40;
pub const IFLA_BR_VLAN_STATS_ENABLED: ::std::os::raw::c_uint = 41;
pub const IFLA_BR_MCAST_STATS_ENABLED: ::std::os::raw::c_uint = 42;
pub const IFLA_BR_MCAST_IGMP_VERSION: ::std::os::raw::c_uint = 43;
pub const IFLA_BR_MCAST_MLD_VERSION: ::std::os::raw::c_uint = 44;
pub const IFLA_BR_VLAN_STATS_PER_PORT: ::std::os::raw::c_uint = 45;
pub const IFLA_BR_MULTI_BOOLOPT: ::std::os::raw::c_uint = 46;
pub const __IFLA_BR_MAX: ::std::os::raw::c_uint = 47;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_bridge_id {
    pub prio: [__u8; 2usize],
    pub addr: [__u8; 6usize],
}
#[test]
fn bindgen_test_layout_ifla_bridge_id() {
    assert_eq!(
        ::std::mem::size_of::<ifla_bridge_id>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_bridge_id))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_bridge_id>(),
        1usize,
        concat!("Alignment of ", stringify!(ifla_bridge_id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_bridge_id>())).prio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_bridge_id),
            "::",
            stringify!(prio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_bridge_id>())).addr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_bridge_id),
            "::",
            stringify!(addr)
        )
    );
}
pub const BRIDGE_MODE_UNSPEC: ::std::os::raw::c_uint = 0;
pub const BRIDGE_MODE_HAIRPIN: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const IFLA_BRPORT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BRPORT_STATE: ::std::os::raw::c_uint = 1;
pub const IFLA_BRPORT_PRIORITY: ::std::os::raw::c_uint = 2;
pub const IFLA_BRPORT_COST: ::std::os::raw::c_uint = 3;
pub const IFLA_BRPORT_MODE: ::std::os::raw::c_uint = 4;
pub const IFLA_BRPORT_GUARD: ::std::os::raw::c_uint = 5;
pub const IFLA_BRPORT_PROTECT: ::std::os::raw::c_uint = 6;
pub const IFLA_BRPORT_FAST_LEAVE: ::std::os::raw::c_uint = 7;
pub const IFLA_BRPORT_LEARNING: ::std::os::raw::c_uint = 8;
pub const IFLA_BRPORT_UNICAST_FLOOD: ::std::os::raw::c_uint = 9;
pub const IFLA_BRPORT_PROXYARP: ::std::os::raw::c_uint = 10;
pub const IFLA_BRPORT_LEARNING_SYNC: ::std::os::raw::c_uint = 11;
pub const IFLA_BRPORT_PROXYARP_WIFI: ::std::os::raw::c_uint = 12;
pub const IFLA_BRPORT_ROOT_ID: ::std::os::raw::c_uint = 13;
pub const IFLA_BRPORT_BRIDGE_ID: ::std::os::raw::c_uint = 14;
pub const IFLA_BRPORT_DESIGNATED_PORT: ::std::os::raw::c_uint = 15;
pub const IFLA_BRPORT_DESIGNATED_COST: ::std::os::raw::c_uint = 16;
pub const IFLA_BRPORT_ID: ::std::os::raw::c_uint = 17;
pub const IFLA_BRPORT_NO: ::std::os::raw::c_uint = 18;
pub const IFLA_BRPORT_TOPOLOGY_CHANGE_ACK: ::std::os::raw::c_uint = 19;
pub const IFLA_BRPORT_CONFIG_PENDING: ::std::os::raw::c_uint = 20;
pub const IFLA_BRPORT_MESSAGE_AGE_TIMER: ::std::os::raw::c_uint = 21;
pub const IFLA_BRPORT_FORWARD_DELAY_TIMER: ::std::os::raw::c_uint = 22;
pub const IFLA_BRPORT_HOLD_TIMER: ::std::os::raw::c_uint = 23;
pub const IFLA_BRPORT_FLUSH: ::std::os::raw::c_uint = 24;
pub const IFLA_BRPORT_MULTICAST_ROUTER: ::std::os::raw::c_uint = 25;
pub const IFLA_BRPORT_PAD: ::std::os::raw::c_uint = 26;
pub const IFLA_BRPORT_MCAST_FLOOD: ::std::os::raw::c_uint = 27;
pub const IFLA_BRPORT_MCAST_TO_UCAST: ::std::os::raw::c_uint = 28;
pub const IFLA_BRPORT_VLAN_TUNNEL: ::std::os::raw::c_uint = 29;
pub const IFLA_BRPORT_BCAST_FLOOD: ::std::os::raw::c_uint = 30;
pub const IFLA_BRPORT_GROUP_FWD_MASK: ::std::os::raw::c_uint = 31;
pub const IFLA_BRPORT_NEIGH_SUPPRESS: ::std::os::raw::c_uint = 32;
pub const IFLA_BRPORT_ISOLATED: ::std::os::raw::c_uint = 33;
pub const IFLA_BRPORT_BACKUP_PORT: ::std::os::raw::c_uint = 34;
pub const IFLA_BRPORT_MRP_RING_OPEN: ::std::os::raw::c_uint = 35;
pub const IFLA_BRPORT_MRP_IN_OPEN: ::std::os::raw::c_uint = 36;
pub const __IFLA_BRPORT_MAX: ::std::os::raw::c_uint = 37;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_cacheinfo {
    pub max_reasm_len: __u32,
    pub tstamp: __u32,
    pub reachable_time: __u32,
    pub retrans_time: __u32,
}
#[test]
fn bindgen_test_layout_ifla_cacheinfo() {
    assert_eq!(
        ::std::mem::size_of::<ifla_cacheinfo>(),
        16usize,
        concat!("Size of: ", stringify!(ifla_cacheinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_cacheinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_cacheinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_cacheinfo>())).max_reasm_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_cacheinfo),
            "::",
            stringify!(max_reasm_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_cacheinfo>())).tstamp as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_cacheinfo),
            "::",
            stringify!(tstamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_cacheinfo>())).reachable_time as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_cacheinfo),
            "::",
            stringify!(reachable_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_cacheinfo>())).retrans_time as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_cacheinfo),
            "::",
            stringify!(retrans_time)
        )
    );
}
pub const IFLA_INFO_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_INFO_KIND: ::std::os::raw::c_uint = 1;
pub const IFLA_INFO_DATA: ::std::os::raw::c_uint = 2;
pub const IFLA_INFO_XSTATS: ::std::os::raw::c_uint = 3;
pub const IFLA_INFO_SLAVE_KIND: ::std::os::raw::c_uint = 4;
pub const IFLA_INFO_SLAVE_DATA: ::std::os::raw::c_uint = 5;
pub const __IFLA_INFO_MAX: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const IFLA_VLAN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VLAN_ID: ::std::os::raw::c_uint = 1;
pub const IFLA_VLAN_FLAGS: ::std::os::raw::c_uint = 2;
pub const IFLA_VLAN_EGRESS_QOS: ::std::os::raw::c_uint = 3;
pub const IFLA_VLAN_INGRESS_QOS: ::std::os::raw::c_uint = 4;
pub const IFLA_VLAN_PROTOCOL: ::std::os::raw::c_uint = 5;
pub const __IFLA_VLAN_MAX: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vlan_flags {
    pub flags: __u32,
    pub mask: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vlan_flags() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vlan_flags>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vlan_flags))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vlan_flags>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vlan_flags))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vlan_flags>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vlan_flags),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vlan_flags>())).mask as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vlan_flags),
            "::",
            stringify!(mask)
        )
    );
}
pub const IFLA_VLAN_QOS_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VLAN_QOS_MAPPING: ::std::os::raw::c_uint = 1;
pub const __IFLA_VLAN_QOS_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vlan_qos_mapping {
    pub from: __u32,
    pub to: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vlan_qos_mapping() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vlan_qos_mapping>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vlan_qos_mapping))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vlan_qos_mapping>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vlan_qos_mapping))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vlan_qos_mapping>())).from as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vlan_qos_mapping),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vlan_qos_mapping>())).to as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vlan_qos_mapping),
            "::",
            stringify!(to)
        )
    );
}
pub const IFLA_MACVLAN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_MACVLAN_MODE: ::std::os::raw::c_uint = 1;
pub const IFLA_MACVLAN_FLAGS: ::std::os::raw::c_uint = 2;
pub const IFLA_MACVLAN_MACADDR_MODE: ::std::os::raw::c_uint = 3;
pub const IFLA_MACVLAN_MACADDR: ::std::os::raw::c_uint = 4;
pub const IFLA_MACVLAN_MACADDR_DATA: ::std::os::raw::c_uint = 5;
pub const IFLA_MACVLAN_MACADDR_COUNT: ::std::os::raw::c_uint = 6;
pub const __IFLA_MACVLAN_MAX: ::std::os::raw::c_uint = 7;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub const macvlan_mode_MACVLAN_MODE_PRIVATE: macvlan_mode = 1;
pub const macvlan_mode_MACVLAN_MODE_VEPA: macvlan_mode = 2;
pub const macvlan_mode_MACVLAN_MODE_BRIDGE: macvlan_mode = 4;
pub const macvlan_mode_MACVLAN_MODE_PASSTHRU: macvlan_mode = 8;
pub const macvlan_mode_MACVLAN_MODE_SOURCE: macvlan_mode = 16;
pub type macvlan_mode = ::std::os::raw::c_uint;
pub const macvlan_macaddr_mode_MACVLAN_MACADDR_ADD: macvlan_macaddr_mode = 0;
pub const macvlan_macaddr_mode_MACVLAN_MACADDR_DEL: macvlan_macaddr_mode = 1;
pub const macvlan_macaddr_mode_MACVLAN_MACADDR_FLUSH: macvlan_macaddr_mode = 2;
pub const macvlan_macaddr_mode_MACVLAN_MACADDR_SET: macvlan_macaddr_mode = 3;
pub type macvlan_macaddr_mode = ::std::os::raw::c_uint;
pub const IFLA_VRF_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VRF_TABLE: ::std::os::raw::c_uint = 1;
pub const __IFLA_VRF_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub const IFLA_VRF_PORT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VRF_PORT_TABLE: ::std::os::raw::c_uint = 1;
pub const __IFLA_VRF_PORT_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
pub const IFLA_MACSEC_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_MACSEC_SCI: ::std::os::raw::c_uint = 1;
pub const IFLA_MACSEC_PORT: ::std::os::raw::c_uint = 2;
pub const IFLA_MACSEC_ICV_LEN: ::std::os::raw::c_uint = 3;
pub const IFLA_MACSEC_CIPHER_SUITE: ::std::os::raw::c_uint = 4;
pub const IFLA_MACSEC_WINDOW: ::std::os::raw::c_uint = 5;
pub const IFLA_MACSEC_ENCODING_SA: ::std::os::raw::c_uint = 6;
pub const IFLA_MACSEC_ENCRYPT: ::std::os::raw::c_uint = 7;
pub const IFLA_MACSEC_PROTECT: ::std::os::raw::c_uint = 8;
pub const IFLA_MACSEC_INC_SCI: ::std::os::raw::c_uint = 9;
pub const IFLA_MACSEC_ES: ::std::os::raw::c_uint = 10;
pub const IFLA_MACSEC_SCB: ::std::os::raw::c_uint = 11;
pub const IFLA_MACSEC_REPLAY_PROTECT: ::std::os::raw::c_uint = 12;
pub const IFLA_MACSEC_VALIDATION: ::std::os::raw::c_uint = 13;
pub const IFLA_MACSEC_PAD: ::std::os::raw::c_uint = 14;
pub const IFLA_MACSEC_OFFLOAD: ::std::os::raw::c_uint = 15;
pub const __IFLA_MACSEC_MAX: ::std::os::raw::c_uint = 16;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
pub const IFLA_XFRM_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_XFRM_LINK: ::std::os::raw::c_uint = 1;
pub const IFLA_XFRM_IF_ID: ::std::os::raw::c_uint = 2;
pub const __IFLA_XFRM_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub const macsec_validation_type_MACSEC_VALIDATE_DISABLED: macsec_validation_type = 0;
pub const macsec_validation_type_MACSEC_VALIDATE_CHECK: macsec_validation_type = 1;
pub const macsec_validation_type_MACSEC_VALIDATE_STRICT: macsec_validation_type = 2;
pub const macsec_validation_type___MACSEC_VALIDATE_END: macsec_validation_type = 3;
pub const macsec_validation_type_MACSEC_VALIDATE_MAX: macsec_validation_type = 2;
pub type macsec_validation_type = ::std::os::raw::c_uint;
pub const macsec_offload_MACSEC_OFFLOAD_OFF: macsec_offload = 0;
pub const macsec_offload_MACSEC_OFFLOAD_PHY: macsec_offload = 1;
pub const macsec_offload_MACSEC_OFFLOAD_MAC: macsec_offload = 2;
pub const macsec_offload___MACSEC_OFFLOAD_END: macsec_offload = 3;
pub const macsec_offload_MACSEC_OFFLOAD_MAX: macsec_offload = 2;
pub type macsec_offload = ::std::os::raw::c_uint;
pub const IFLA_IPVLAN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_IPVLAN_MODE: ::std::os::raw::c_uint = 1;
pub const IFLA_IPVLAN_FLAGS: ::std::os::raw::c_uint = 2;
pub const __IFLA_IPVLAN_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
pub const ipvlan_mode_IPVLAN_MODE_L2: ipvlan_mode = 0;
pub const ipvlan_mode_IPVLAN_MODE_L3: ipvlan_mode = 1;
pub const ipvlan_mode_IPVLAN_MODE_L3S: ipvlan_mode = 2;
pub const ipvlan_mode_IPVLAN_MODE_MAX: ipvlan_mode = 3;
pub type ipvlan_mode = ::std::os::raw::c_uint;
pub const IFLA_VXLAN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VXLAN_ID: ::std::os::raw::c_uint = 1;
pub const IFLA_VXLAN_GROUP: ::std::os::raw::c_uint = 2;
pub const IFLA_VXLAN_LINK: ::std::os::raw::c_uint = 3;
pub const IFLA_VXLAN_LOCAL: ::std::os::raw::c_uint = 4;
pub const IFLA_VXLAN_TTL: ::std::os::raw::c_uint = 5;
pub const IFLA_VXLAN_TOS: ::std::os::raw::c_uint = 6;
pub const IFLA_VXLAN_LEARNING: ::std::os::raw::c_uint = 7;
pub const IFLA_VXLAN_AGEING: ::std::os::raw::c_uint = 8;
pub const IFLA_VXLAN_LIMIT: ::std::os::raw::c_uint = 9;
pub const IFLA_VXLAN_PORT_RANGE: ::std::os::raw::c_uint = 10;
pub const IFLA_VXLAN_PROXY: ::std::os::raw::c_uint = 11;
pub const IFLA_VXLAN_RSC: ::std::os::raw::c_uint = 12;
pub const IFLA_VXLAN_L2MISS: ::std::os::raw::c_uint = 13;
pub const IFLA_VXLAN_L3MISS: ::std::os::raw::c_uint = 14;
pub const IFLA_VXLAN_PORT: ::std::os::raw::c_uint = 15;
pub const IFLA_VXLAN_GROUP6: ::std::os::raw::c_uint = 16;
pub const IFLA_VXLAN_LOCAL6: ::std::os::raw::c_uint = 17;
pub const IFLA_VXLAN_UDP_CSUM: ::std::os::raw::c_uint = 18;
pub const IFLA_VXLAN_UDP_ZERO_CSUM6_TX: ::std::os::raw::c_uint = 19;
pub const IFLA_VXLAN_UDP_ZERO_CSUM6_RX: ::std::os::raw::c_uint = 20;
pub const IFLA_VXLAN_REMCSUM_TX: ::std::os::raw::c_uint = 21;
pub const IFLA_VXLAN_REMCSUM_RX: ::std::os::raw::c_uint = 22;
pub const IFLA_VXLAN_GBP: ::std::os::raw::c_uint = 23;
pub const IFLA_VXLAN_REMCSUM_NOPARTIAL: ::std::os::raw::c_uint = 24;
pub const IFLA_VXLAN_COLLECT_METADATA: ::std::os::raw::c_uint = 25;
pub const IFLA_VXLAN_LABEL: ::std::os::raw::c_uint = 26;
pub const IFLA_VXLAN_GPE: ::std::os::raw::c_uint = 27;
pub const IFLA_VXLAN_TTL_INHERIT: ::std::os::raw::c_uint = 28;
pub const IFLA_VXLAN_DF: ::std::os::raw::c_uint = 29;
pub const __IFLA_VXLAN_MAX: ::std::os::raw::c_uint = 30;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vxlan_port_range {
    pub low: __be16,
    pub high: __be16,
}
#[test]
fn bindgen_test_layout_ifla_vxlan_port_range() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vxlan_port_range>(),
        4usize,
        concat!("Size of: ", stringify!(ifla_vxlan_port_range))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vxlan_port_range>(),
        2usize,
        concat!("Alignment of ", stringify!(ifla_vxlan_port_range))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vxlan_port_range>())).low as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vxlan_port_range),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vxlan_port_range>())).high as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vxlan_port_range),
            "::",
            stringify!(high)
        )
    );
}
pub const ifla_vxlan_df_VXLAN_DF_UNSET: ifla_vxlan_df = 0;
pub const ifla_vxlan_df_VXLAN_DF_SET: ifla_vxlan_df = 1;
pub const ifla_vxlan_df_VXLAN_DF_INHERIT: ifla_vxlan_df = 2;
pub const ifla_vxlan_df___VXLAN_DF_END: ifla_vxlan_df = 3;
pub const ifla_vxlan_df_VXLAN_DF_MAX: ifla_vxlan_df = 2;
pub type ifla_vxlan_df = ::std::os::raw::c_uint;
pub const IFLA_GENEVE_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_GENEVE_ID: ::std::os::raw::c_uint = 1;
pub const IFLA_GENEVE_REMOTE: ::std::os::raw::c_uint = 2;
pub const IFLA_GENEVE_TTL: ::std::os::raw::c_uint = 3;
pub const IFLA_GENEVE_TOS: ::std::os::raw::c_uint = 4;
pub const IFLA_GENEVE_PORT: ::std::os::raw::c_uint = 5;
pub const IFLA_GENEVE_COLLECT_METADATA: ::std::os::raw::c_uint = 6;
pub const IFLA_GENEVE_REMOTE6: ::std::os::raw::c_uint = 7;
pub const IFLA_GENEVE_UDP_CSUM: ::std::os::raw::c_uint = 8;
pub const IFLA_GENEVE_UDP_ZERO_CSUM6_TX: ::std::os::raw::c_uint = 9;
pub const IFLA_GENEVE_UDP_ZERO_CSUM6_RX: ::std::os::raw::c_uint = 10;
pub const IFLA_GENEVE_LABEL: ::std::os::raw::c_uint = 11;
pub const IFLA_GENEVE_TTL_INHERIT: ::std::os::raw::c_uint = 12;
pub const IFLA_GENEVE_DF: ::std::os::raw::c_uint = 13;
pub const __IFLA_GENEVE_MAX: ::std::os::raw::c_uint = 14;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
pub const ifla_geneve_df_GENEVE_DF_UNSET: ifla_geneve_df = 0;
pub const ifla_geneve_df_GENEVE_DF_SET: ifla_geneve_df = 1;
pub const ifla_geneve_df_GENEVE_DF_INHERIT: ifla_geneve_df = 2;
pub const ifla_geneve_df___GENEVE_DF_END: ifla_geneve_df = 3;
pub const ifla_geneve_df_GENEVE_DF_MAX: ifla_geneve_df = 2;
pub type ifla_geneve_df = ::std::os::raw::c_uint;
pub const IFLA_BAREUDP_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BAREUDP_PORT: ::std::os::raw::c_uint = 1;
pub const IFLA_BAREUDP_ETHERTYPE: ::std::os::raw::c_uint = 2;
pub const IFLA_BAREUDP_SRCPORT_MIN: ::std::os::raw::c_uint = 3;
pub const IFLA_BAREUDP_MULTIPROTO_MODE: ::std::os::raw::c_uint = 4;
pub const __IFLA_BAREUDP_MAX: ::std::os::raw::c_uint = 5;
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
pub const IFLA_PPP_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_PPP_DEV_FD: ::std::os::raw::c_uint = 1;
pub const __IFLA_PPP_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_21 = ::std::os::raw::c_uint;
pub const ifla_gtp_role_GTP_ROLE_GGSN: ifla_gtp_role = 0;
pub const ifla_gtp_role_GTP_ROLE_SGSN: ifla_gtp_role = 1;
pub type ifla_gtp_role = ::std::os::raw::c_uint;
pub const IFLA_GTP_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_GTP_FD0: ::std::os::raw::c_uint = 1;
pub const IFLA_GTP_FD1: ::std::os::raw::c_uint = 2;
pub const IFLA_GTP_PDP_HASHSIZE: ::std::os::raw::c_uint = 3;
pub const IFLA_GTP_ROLE: ::std::os::raw::c_uint = 4;
pub const __IFLA_GTP_MAX: ::std::os::raw::c_uint = 5;
pub type _bindgen_ty_22 = ::std::os::raw::c_uint;
pub const IFLA_BOND_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BOND_MODE: ::std::os::raw::c_uint = 1;
pub const IFLA_BOND_ACTIVE_SLAVE: ::std::os::raw::c_uint = 2;
pub const IFLA_BOND_MIIMON: ::std::os::raw::c_uint = 3;
pub const IFLA_BOND_UPDELAY: ::std::os::raw::c_uint = 4;
pub const IFLA_BOND_DOWNDELAY: ::std::os::raw::c_uint = 5;
pub const IFLA_BOND_USE_CARRIER: ::std::os::raw::c_uint = 6;
pub const IFLA_BOND_ARP_INTERVAL: ::std::os::raw::c_uint = 7;
pub const IFLA_BOND_ARP_IP_TARGET: ::std::os::raw::c_uint = 8;
pub const IFLA_BOND_ARP_VALIDATE: ::std::os::raw::c_uint = 9;
pub const IFLA_BOND_ARP_ALL_TARGETS: ::std::os::raw::c_uint = 10;
pub const IFLA_BOND_PRIMARY: ::std::os::raw::c_uint = 11;
pub const IFLA_BOND_PRIMARY_RESELECT: ::std::os::raw::c_uint = 12;
pub const IFLA_BOND_FAIL_OVER_MAC: ::std::os::raw::c_uint = 13;
pub const IFLA_BOND_XMIT_HASH_POLICY: ::std::os::raw::c_uint = 14;
pub const IFLA_BOND_RESEND_IGMP: ::std::os::raw::c_uint = 15;
pub const IFLA_BOND_NUM_PEER_NOTIF: ::std::os::raw::c_uint = 16;
pub const IFLA_BOND_ALL_SLAVES_ACTIVE: ::std::os::raw::c_uint = 17;
pub const IFLA_BOND_MIN_LINKS: ::std::os::raw::c_uint = 18;
pub const IFLA_BOND_LP_INTERVAL: ::std::os::raw::c_uint = 19;
pub const IFLA_BOND_PACKETS_PER_SLAVE: ::std::os::raw::c_uint = 20;
pub const IFLA_BOND_AD_LACP_RATE: ::std::os::raw::c_uint = 21;
pub const IFLA_BOND_AD_SELECT: ::std::os::raw::c_uint = 22;
pub const IFLA_BOND_AD_INFO: ::std::os::raw::c_uint = 23;
pub const IFLA_BOND_AD_ACTOR_SYS_PRIO: ::std::os::raw::c_uint = 24;
pub const IFLA_BOND_AD_USER_PORT_KEY: ::std::os::raw::c_uint = 25;
pub const IFLA_BOND_AD_ACTOR_SYSTEM: ::std::os::raw::c_uint = 26;
pub const IFLA_BOND_TLB_DYNAMIC_LB: ::std::os::raw::c_uint = 27;
pub const IFLA_BOND_PEER_NOTIF_DELAY: ::std::os::raw::c_uint = 28;
pub const __IFLA_BOND_MAX: ::std::os::raw::c_uint = 29;
pub type _bindgen_ty_23 = ::std::os::raw::c_uint;
pub const IFLA_BOND_AD_INFO_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BOND_AD_INFO_AGGREGATOR: ::std::os::raw::c_uint = 1;
pub const IFLA_BOND_AD_INFO_NUM_PORTS: ::std::os::raw::c_uint = 2;
pub const IFLA_BOND_AD_INFO_ACTOR_KEY: ::std::os::raw::c_uint = 3;
pub const IFLA_BOND_AD_INFO_PARTNER_KEY: ::std::os::raw::c_uint = 4;
pub const IFLA_BOND_AD_INFO_PARTNER_MAC: ::std::os::raw::c_uint = 5;
pub const __IFLA_BOND_AD_INFO_MAX: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_24 = ::std::os::raw::c_uint;
pub const IFLA_BOND_SLAVE_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_BOND_SLAVE_STATE: ::std::os::raw::c_uint = 1;
pub const IFLA_BOND_SLAVE_MII_STATUS: ::std::os::raw::c_uint = 2;
pub const IFLA_BOND_SLAVE_LINK_FAILURE_COUNT: ::std::os::raw::c_uint = 3;
pub const IFLA_BOND_SLAVE_PERM_HWADDR: ::std::os::raw::c_uint = 4;
pub const IFLA_BOND_SLAVE_QUEUE_ID: ::std::os::raw::c_uint = 5;
pub const IFLA_BOND_SLAVE_AD_AGGREGATOR_ID: ::std::os::raw::c_uint = 6;
pub const IFLA_BOND_SLAVE_AD_ACTOR_OPER_PORT_STATE: ::std::os::raw::c_uint = 7;
pub const IFLA_BOND_SLAVE_AD_PARTNER_OPER_PORT_STATE: ::std::os::raw::c_uint = 8;
pub const __IFLA_BOND_SLAVE_MAX: ::std::os::raw::c_uint = 9;
pub type _bindgen_ty_25 = ::std::os::raw::c_uint;
pub const IFLA_VF_INFO_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_INFO: ::std::os::raw::c_uint = 1;
pub const __IFLA_VF_INFO_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_26 = ::std::os::raw::c_uint;
pub const IFLA_VF_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_MAC: ::std::os::raw::c_uint = 1;
pub const IFLA_VF_VLAN: ::std::os::raw::c_uint = 2;
pub const IFLA_VF_TX_RATE: ::std::os::raw::c_uint = 3;
pub const IFLA_VF_SPOOFCHK: ::std::os::raw::c_uint = 4;
pub const IFLA_VF_LINK_STATE: ::std::os::raw::c_uint = 5;
pub const IFLA_VF_RATE: ::std::os::raw::c_uint = 6;
pub const IFLA_VF_RSS_QUERY_EN: ::std::os::raw::c_uint = 7;
pub const IFLA_VF_STATS: ::std::os::raw::c_uint = 8;
pub const IFLA_VF_TRUST: ::std::os::raw::c_uint = 9;
pub const IFLA_VF_IB_NODE_GUID: ::std::os::raw::c_uint = 10;
pub const IFLA_VF_IB_PORT_GUID: ::std::os::raw::c_uint = 11;
pub const IFLA_VF_VLAN_LIST: ::std::os::raw::c_uint = 12;
pub const IFLA_VF_BROADCAST: ::std::os::raw::c_uint = 13;
pub const __IFLA_VF_MAX: ::std::os::raw::c_uint = 14;
pub type _bindgen_ty_27 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_mac {
    pub vf: __u32,
    pub mac: [__u8; 32usize],
}
#[test]
fn bindgen_test_layout_ifla_vf_mac() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_mac>(),
        36usize,
        concat!("Size of: ", stringify!(ifla_vf_mac))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_mac>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_mac))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_mac>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_mac),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_mac>())).mac as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_mac),
            "::",
            stringify!(mac)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_broadcast {
    pub broadcast: [__u8; 32usize],
}
#[test]
fn bindgen_test_layout_ifla_vf_broadcast() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_broadcast>(),
        32usize,
        concat!("Size of: ", stringify!(ifla_vf_broadcast))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_broadcast>(),
        1usize,
        concat!("Alignment of ", stringify!(ifla_vf_broadcast))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_broadcast>())).broadcast as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_broadcast),
            "::",
            stringify!(broadcast)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_vlan {
    pub vf: __u32,
    pub vlan: __u32,
    pub qos: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_vlan() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_vlan>(),
        12usize,
        concat!("Size of: ", stringify!(ifla_vf_vlan))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_vlan>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_vlan))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan>())).vlan as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan),
            "::",
            stringify!(vlan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan>())).qos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan),
            "::",
            stringify!(qos)
        )
    );
}
pub const IFLA_VF_VLAN_INFO_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_VLAN_INFO: ::std::os::raw::c_uint = 1;
pub const __IFLA_VF_VLAN_INFO_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_28 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_vlan_info {
    pub vf: __u32,
    pub vlan: __u32,
    pub qos: __u32,
    pub vlan_proto: __be16,
}
#[test]
fn bindgen_test_layout_ifla_vf_vlan_info() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_vlan_info>(),
        16usize,
        concat!("Size of: ", stringify!(ifla_vf_vlan_info))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_vlan_info>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_vlan_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan_info>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan_info),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan_info>())).vlan as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan_info),
            "::",
            stringify!(vlan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan_info>())).qos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan_info),
            "::",
            stringify!(qos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_vlan_info>())).vlan_proto as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_vlan_info),
            "::",
            stringify!(vlan_proto)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_tx_rate {
    pub vf: __u32,
    pub rate: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_tx_rate() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_tx_rate>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vf_tx_rate))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_tx_rate>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_tx_rate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_tx_rate>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_tx_rate),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_tx_rate>())).rate as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_tx_rate),
            "::",
            stringify!(rate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_rate {
    pub vf: __u32,
    pub min_tx_rate: __u32,
    pub max_tx_rate: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_rate() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_rate>(),
        12usize,
        concat!("Size of: ", stringify!(ifla_vf_rate))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_rate>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_rate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_rate>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_rate),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_rate>())).min_tx_rate as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_rate),
            "::",
            stringify!(min_tx_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_rate>())).max_tx_rate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_rate),
            "::",
            stringify!(max_tx_rate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_spoofchk {
    pub vf: __u32,
    pub setting: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_spoofchk() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_spoofchk>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vf_spoofchk))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_spoofchk>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_spoofchk))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_spoofchk>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_spoofchk),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_spoofchk>())).setting as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_spoofchk),
            "::",
            stringify!(setting)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_guid {
    pub vf: __u32,
    pub guid: __u64,
}
#[test]
fn bindgen_test_layout_ifla_vf_guid() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_guid>(),
        16usize,
        concat!("Size of: ", stringify!(ifla_vf_guid))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_guid>(),
        8usize,
        concat!("Alignment of ", stringify!(ifla_vf_guid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_guid>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_guid),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_guid>())).guid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_guid),
            "::",
            stringify!(guid)
        )
    );
}
pub const IFLA_VF_LINK_STATE_AUTO: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_LINK_STATE_ENABLE: ::std::os::raw::c_uint = 1;
pub const IFLA_VF_LINK_STATE_DISABLE: ::std::os::raw::c_uint = 2;
pub const __IFLA_VF_LINK_STATE_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_29 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_link_state {
    pub vf: __u32,
    pub link_state: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_link_state() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_link_state>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vf_link_state))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_link_state>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_link_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_link_state>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_link_state),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_link_state>())).link_state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_link_state),
            "::",
            stringify!(link_state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_rss_query_en {
    pub vf: __u32,
    pub setting: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_rss_query_en() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_rss_query_en>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vf_rss_query_en))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_rss_query_en>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_rss_query_en))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_rss_query_en>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_rss_query_en),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_rss_query_en>())).setting as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_rss_query_en),
            "::",
            stringify!(setting)
        )
    );
}
pub const IFLA_VF_STATS_RX_PACKETS: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_STATS_TX_PACKETS: ::std::os::raw::c_uint = 1;
pub const IFLA_VF_STATS_RX_BYTES: ::std::os::raw::c_uint = 2;
pub const IFLA_VF_STATS_TX_BYTES: ::std::os::raw::c_uint = 3;
pub const IFLA_VF_STATS_BROADCAST: ::std::os::raw::c_uint = 4;
pub const IFLA_VF_STATS_MULTICAST: ::std::os::raw::c_uint = 5;
pub const IFLA_VF_STATS_PAD: ::std::os::raw::c_uint = 6;
pub const IFLA_VF_STATS_RX_DROPPED: ::std::os::raw::c_uint = 7;
pub const IFLA_VF_STATS_TX_DROPPED: ::std::os::raw::c_uint = 8;
pub const __IFLA_VF_STATS_MAX: ::std::os::raw::c_uint = 9;
pub type _bindgen_ty_30 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_vf_trust {
    pub vf: __u32,
    pub setting: __u32,
}
#[test]
fn bindgen_test_layout_ifla_vf_trust() {
    assert_eq!(
        ::std::mem::size_of::<ifla_vf_trust>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_vf_trust))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_vf_trust>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_vf_trust))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_trust>())).vf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_trust),
            "::",
            stringify!(vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_vf_trust>())).setting as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_vf_trust),
            "::",
            stringify!(setting)
        )
    );
}
pub const IFLA_VF_PORT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_VF_PORT: ::std::os::raw::c_uint = 1;
pub const __IFLA_VF_PORT_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_31 = ::std::os::raw::c_uint;
pub const IFLA_PORT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_PORT_VF: ::std::os::raw::c_uint = 1;
pub const IFLA_PORT_PROFILE: ::std::os::raw::c_uint = 2;
pub const IFLA_PORT_VSI_TYPE: ::std::os::raw::c_uint = 3;
pub const IFLA_PORT_INSTANCE_UUID: ::std::os::raw::c_uint = 4;
pub const IFLA_PORT_HOST_UUID: ::std::os::raw::c_uint = 5;
pub const IFLA_PORT_REQUEST: ::std::os::raw::c_uint = 6;
pub const IFLA_PORT_RESPONSE: ::std::os::raw::c_uint = 7;
pub const __IFLA_PORT_MAX: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_32 = ::std::os::raw::c_uint;
pub const PORT_REQUEST_PREASSOCIATE: ::std::os::raw::c_uint = 0;
pub const PORT_REQUEST_PREASSOCIATE_RR: ::std::os::raw::c_uint = 1;
pub const PORT_REQUEST_ASSOCIATE: ::std::os::raw::c_uint = 2;
pub const PORT_REQUEST_DISASSOCIATE: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_33 = ::std::os::raw::c_uint;
pub const PORT_VDP_RESPONSE_SUCCESS: ::std::os::raw::c_uint = 0;
pub const PORT_VDP_RESPONSE_INVALID_FORMAT: ::std::os::raw::c_uint = 1;
pub const PORT_VDP_RESPONSE_INSUFFICIENT_RESOURCES: ::std::os::raw::c_uint = 2;
pub const PORT_VDP_RESPONSE_UNUSED_VTID: ::std::os::raw::c_uint = 3;
pub const PORT_VDP_RESPONSE_VTID_VIOLATION: ::std::os::raw::c_uint = 4;
pub const PORT_VDP_RESPONSE_VTID_VERSION_VIOALTION: ::std::os::raw::c_uint = 5;
pub const PORT_VDP_RESPONSE_OUT_OF_SYNC: ::std::os::raw::c_uint = 6;
pub const PORT_PROFILE_RESPONSE_SUCCESS: ::std::os::raw::c_uint = 256;
pub const PORT_PROFILE_RESPONSE_INPROGRESS: ::std::os::raw::c_uint = 257;
pub const PORT_PROFILE_RESPONSE_INVALID: ::std::os::raw::c_uint = 258;
pub const PORT_PROFILE_RESPONSE_BADSTATE: ::std::os::raw::c_uint = 259;
pub const PORT_PROFILE_RESPONSE_INSUFFICIENT_RESOURCES: ::std::os::raw::c_uint = 260;
pub const PORT_PROFILE_RESPONSE_ERROR: ::std::os::raw::c_uint = 261;
pub type _bindgen_ty_34 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_port_vsi {
    pub vsi_mgr_id: __u8,
    pub vsi_type_id: [__u8; 3usize],
    pub vsi_type_version: __u8,
    pub pad: [__u8; 3usize],
}
#[test]
fn bindgen_test_layout_ifla_port_vsi() {
    assert_eq!(
        ::std::mem::size_of::<ifla_port_vsi>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_port_vsi))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_port_vsi>(),
        1usize,
        concat!("Alignment of ", stringify!(ifla_port_vsi))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_port_vsi>())).vsi_mgr_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_port_vsi),
            "::",
            stringify!(vsi_mgr_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_port_vsi>())).vsi_type_id as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_port_vsi),
            "::",
            stringify!(vsi_type_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_port_vsi>())).vsi_type_version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_port_vsi),
            "::",
            stringify!(vsi_type_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_port_vsi>())).pad as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_port_vsi),
            "::",
            stringify!(pad)
        )
    );
}
pub const IFLA_IPOIB_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_IPOIB_PKEY: ::std::os::raw::c_uint = 1;
pub const IFLA_IPOIB_MODE: ::std::os::raw::c_uint = 2;
pub const IFLA_IPOIB_UMCAST: ::std::os::raw::c_uint = 3;
pub const __IFLA_IPOIB_MAX: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_35 = ::std::os::raw::c_uint;
pub const IPOIB_MODE_DATAGRAM: ::std::os::raw::c_uint = 0;
pub const IPOIB_MODE_CONNECTED: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_36 = ::std::os::raw::c_uint;
pub const HSR_PROTOCOL_HSR: ::std::os::raw::c_uint = 0;
pub const HSR_PROTOCOL_PRP: ::std::os::raw::c_uint = 1;
pub const HSR_PROTOCOL_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_37 = ::std::os::raw::c_uint;
pub const IFLA_HSR_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_HSR_SLAVE1: ::std::os::raw::c_uint = 1;
pub const IFLA_HSR_SLAVE2: ::std::os::raw::c_uint = 2;
pub const IFLA_HSR_MULTICAST_SPEC: ::std::os::raw::c_uint = 3;
pub const IFLA_HSR_SUPERVISION_ADDR: ::std::os::raw::c_uint = 4;
pub const IFLA_HSR_SEQ_NR: ::std::os::raw::c_uint = 5;
pub const IFLA_HSR_VERSION: ::std::os::raw::c_uint = 6;
pub const IFLA_HSR_PROTOCOL: ::std::os::raw::c_uint = 7;
pub const __IFLA_HSR_MAX: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_38 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct if_stats_msg {
    pub family: __u8,
    pub pad1: __u8,
    pub pad2: __u16,
    pub ifindex: __u32,
    pub filter_mask: __u32,
}
#[test]
fn bindgen_test_layout_if_stats_msg() {
    assert_eq!(
        ::std::mem::size_of::<if_stats_msg>(),
        12usize,
        concat!("Size of: ", stringify!(if_stats_msg))
    );
    assert_eq!(
        ::std::mem::align_of::<if_stats_msg>(),
        4usize,
        concat!("Alignment of ", stringify!(if_stats_msg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<if_stats_msg>())).family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(if_stats_msg),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<if_stats_msg>())).pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(if_stats_msg),
            "::",
            stringify!(pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<if_stats_msg>())).pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(if_stats_msg),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<if_stats_msg>())).ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(if_stats_msg),
            "::",
            stringify!(ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<if_stats_msg>())).filter_mask as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(if_stats_msg),
            "::",
            stringify!(filter_mask)
        )
    );
}
pub const IFLA_STATS_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_STATS_LINK_64: ::std::os::raw::c_uint = 1;
pub const IFLA_STATS_LINK_XSTATS: ::std::os::raw::c_uint = 2;
pub const IFLA_STATS_LINK_XSTATS_SLAVE: ::std::os::raw::c_uint = 3;
pub const IFLA_STATS_LINK_OFFLOAD_XSTATS: ::std::os::raw::c_uint = 4;
pub const IFLA_STATS_AF_SPEC: ::std::os::raw::c_uint = 5;
pub const __IFLA_STATS_MAX: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_39 = ::std::os::raw::c_uint;
pub const LINK_XSTATS_TYPE_UNSPEC: ::std::os::raw::c_uint = 0;
pub const LINK_XSTATS_TYPE_BRIDGE: ::std::os::raw::c_uint = 1;
pub const LINK_XSTATS_TYPE_BOND: ::std::os::raw::c_uint = 2;
pub const __LINK_XSTATS_TYPE_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_40 = ::std::os::raw::c_uint;
pub const IFLA_OFFLOAD_XSTATS_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_OFFLOAD_XSTATS_CPU_HIT: ::std::os::raw::c_uint = 1;
pub const __IFLA_OFFLOAD_XSTATS_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_41 = ::std::os::raw::c_uint;
pub const XDP_ATTACHED_NONE: ::std::os::raw::c_uint = 0;
pub const XDP_ATTACHED_DRV: ::std::os::raw::c_uint = 1;
pub const XDP_ATTACHED_SKB: ::std::os::raw::c_uint = 2;
pub const XDP_ATTACHED_HW: ::std::os::raw::c_uint = 3;
pub const XDP_ATTACHED_MULTI: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_42 = ::std::os::raw::c_uint;
pub const IFLA_XDP_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_XDP_FD: ::std::os::raw::c_uint = 1;
pub const IFLA_XDP_ATTACHED: ::std::os::raw::c_uint = 2;
pub const IFLA_XDP_FLAGS: ::std::os::raw::c_uint = 3;
pub const IFLA_XDP_PROG_ID: ::std::os::raw::c_uint = 4;
pub const IFLA_XDP_DRV_PROG_ID: ::std::os::raw::c_uint = 5;
pub const IFLA_XDP_SKB_PROG_ID: ::std::os::raw::c_uint = 6;
pub const IFLA_XDP_HW_PROG_ID: ::std::os::raw::c_uint = 7;
pub const IFLA_XDP_EXPECTED_FD: ::std::os::raw::c_uint = 8;
pub const __IFLA_XDP_MAX: ::std::os::raw::c_uint = 9;
pub type _bindgen_ty_43 = ::std::os::raw::c_uint;
pub const IFLA_EVENT_NONE: ::std::os::raw::c_uint = 0;
pub const IFLA_EVENT_REBOOT: ::std::os::raw::c_uint = 1;
pub const IFLA_EVENT_FEATURES: ::std::os::raw::c_uint = 2;
pub const IFLA_EVENT_BONDING_FAILOVER: ::std::os::raw::c_uint = 3;
pub const IFLA_EVENT_NOTIFY_PEERS: ::std::os::raw::c_uint = 4;
pub const IFLA_EVENT_IGMP_RESEND: ::std::os::raw::c_uint = 5;
pub const IFLA_EVENT_BONDING_OPTIONS: ::std::os::raw::c_uint = 6;
pub type _bindgen_ty_44 = ::std::os::raw::c_uint;
pub const IFLA_TUN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_TUN_OWNER: ::std::os::raw::c_uint = 1;
pub const IFLA_TUN_GROUP: ::std::os::raw::c_uint = 2;
pub const IFLA_TUN_TYPE: ::std::os::raw::c_uint = 3;
pub const IFLA_TUN_PI: ::std::os::raw::c_uint = 4;
pub const IFLA_TUN_VNET_HDR: ::std::os::raw::c_uint = 5;
pub const IFLA_TUN_PERSIST: ::std::os::raw::c_uint = 6;
pub const IFLA_TUN_MULTI_QUEUE: ::std::os::raw::c_uint = 7;
pub const IFLA_TUN_NUM_QUEUES: ::std::os::raw::c_uint = 8;
pub const IFLA_TUN_NUM_DISABLED_QUEUES: ::std::os::raw::c_uint = 9;
pub const __IFLA_TUN_MAX: ::std::os::raw::c_uint = 10;
pub type _bindgen_ty_45 = ::std::os::raw::c_uint;
pub const IFLA_RMNET_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFLA_RMNET_MUX_ID: ::std::os::raw::c_uint = 1;
pub const IFLA_RMNET_FLAGS: ::std::os::raw::c_uint = 2;
pub const __IFLA_RMNET_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_46 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifla_rmnet_flags {
    pub flags: __u32,
    pub mask: __u32,
}
#[test]
fn bindgen_test_layout_ifla_rmnet_flags() {
    assert_eq!(
        ::std::mem::size_of::<ifla_rmnet_flags>(),
        8usize,
        concat!("Size of: ", stringify!(ifla_rmnet_flags))
    );
    assert_eq!(
        ::std::mem::align_of::<ifla_rmnet_flags>(),
        4usize,
        concat!("Alignment of ", stringify!(ifla_rmnet_flags))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_rmnet_flags>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_rmnet_flags),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifla_rmnet_flags>())).mask as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifla_rmnet_flags),
            "::",
            stringify!(mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifaddrmsg {
    pub ifa_family: __u8,
    pub ifa_prefixlen: __u8,
    pub ifa_flags: __u8,
    pub ifa_scope: __u8,
    pub ifa_index: __u32,
}
#[test]
fn bindgen_test_layout_ifaddrmsg() {
    assert_eq!(
        ::std::mem::size_of::<ifaddrmsg>(),
        8usize,
        concat!("Size of: ", stringify!(ifaddrmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaddrmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(ifaddrmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifaddrmsg>())).ifa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrmsg),
            "::",
            stringify!(ifa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifaddrmsg>())).ifa_prefixlen as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrmsg),
            "::",
            stringify!(ifa_prefixlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifaddrmsg>())).ifa_flags as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrmsg),
            "::",
            stringify!(ifa_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifaddrmsg>())).ifa_scope as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrmsg),
            "::",
            stringify!(ifa_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifaddrmsg>())).ifa_index as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrmsg),
            "::",
            stringify!(ifa_index)
        )
    );
}
pub const IFA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IFA_ADDRESS: ::std::os::raw::c_uint = 1;
pub const IFA_LOCAL: ::std::os::raw::c_uint = 2;
pub const IFA_LABEL: ::std::os::raw::c_uint = 3;
pub const IFA_BROADCAST: ::std::os::raw::c_uint = 4;
pub const IFA_ANYCAST: ::std::os::raw::c_uint = 5;
pub const IFA_CACHEINFO: ::std::os::raw::c_uint = 6;
pub const IFA_MULTICAST: ::std::os::raw::c_uint = 7;
pub const IFA_FLAGS: ::std::os::raw::c_uint = 8;
pub const IFA_RT_PRIORITY: ::std::os::raw::c_uint = 9;
pub const IFA_TARGET_NETNSID: ::std::os::raw::c_uint = 10;
pub const __IFA_MAX: ::std::os::raw::c_uint = 11;
pub type _bindgen_ty_47 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifa_cacheinfo {
    pub ifa_prefered: __u32,
    pub ifa_valid: __u32,
    pub cstamp: __u32,
    pub tstamp: __u32,
}
#[test]
fn bindgen_test_layout_ifa_cacheinfo() {
    assert_eq!(
        ::std::mem::size_of::<ifa_cacheinfo>(),
        16usize,
        concat!("Size of: ", stringify!(ifa_cacheinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ifa_cacheinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ifa_cacheinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifa_cacheinfo>())).ifa_prefered as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_cacheinfo),
            "::",
            stringify!(ifa_prefered)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifa_cacheinfo>())).ifa_valid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_cacheinfo),
            "::",
            stringify!(ifa_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifa_cacheinfo>())).cstamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_cacheinfo),
            "::",
            stringify!(cstamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifa_cacheinfo>())).tstamp as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifa_cacheinfo),
            "::",
            stringify!(tstamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndmsg {
    pub ndm_family: __u8,
    pub ndm_pad1: __u8,
    pub ndm_pad2: __u16,
    pub ndm_ifindex: __s32,
    pub ndm_state: __u16,
    pub ndm_flags: __u8,
    pub ndm_type: __u8,
}
#[test]
fn bindgen_test_layout_ndmsg() {
    assert_eq!(
        ::std::mem::size_of::<ndmsg>(),
        12usize,
        concat!("Size of: ", stringify!(ndmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<ndmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(ndmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_flags as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndmsg>())).ndm_type as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(ndmsg),
            "::",
            stringify!(ndm_type)
        )
    );
}
pub const NDA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NDA_DST: ::std::os::raw::c_uint = 1;
pub const NDA_LLADDR: ::std::os::raw::c_uint = 2;
pub const NDA_CACHEINFO: ::std::os::raw::c_uint = 3;
pub const NDA_PROBES: ::std::os::raw::c_uint = 4;
pub const NDA_VLAN: ::std::os::raw::c_uint = 5;
pub const NDA_PORT: ::std::os::raw::c_uint = 6;
pub const NDA_VNI: ::std::os::raw::c_uint = 7;
pub const NDA_IFINDEX: ::std::os::raw::c_uint = 8;
pub const NDA_MASTER: ::std::os::raw::c_uint = 9;
pub const NDA_LINK_NETNSID: ::std::os::raw::c_uint = 10;
pub const NDA_SRC_VNI: ::std::os::raw::c_uint = 11;
pub const NDA_PROTOCOL: ::std::os::raw::c_uint = 12;
pub const NDA_NH_ID: ::std::os::raw::c_uint = 13;
pub const NDA_FDB_EXT_ATTRS: ::std::os::raw::c_uint = 14;
pub const __NDA_MAX: ::std::os::raw::c_uint = 15;
pub type _bindgen_ty_48 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nda_cacheinfo {
    pub ndm_confirmed: __u32,
    pub ndm_used: __u32,
    pub ndm_updated: __u32,
    pub ndm_refcnt: __u32,
}
#[test]
fn bindgen_test_layout_nda_cacheinfo() {
    assert_eq!(
        ::std::mem::size_of::<nda_cacheinfo>(),
        16usize,
        concat!("Size of: ", stringify!(nda_cacheinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<nda_cacheinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(nda_cacheinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nda_cacheinfo>())).ndm_confirmed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nda_cacheinfo),
            "::",
            stringify!(ndm_confirmed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nda_cacheinfo>())).ndm_used as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nda_cacheinfo),
            "::",
            stringify!(ndm_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nda_cacheinfo>())).ndm_updated as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nda_cacheinfo),
            "::",
            stringify!(ndm_updated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nda_cacheinfo>())).ndm_refcnt as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nda_cacheinfo),
            "::",
            stringify!(ndm_refcnt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndt_stats {
    pub ndts_allocs: __u64,
    pub ndts_destroys: __u64,
    pub ndts_hash_grows: __u64,
    pub ndts_res_failed: __u64,
    pub ndts_lookups: __u64,
    pub ndts_hits: __u64,
    pub ndts_rcv_probes_mcast: __u64,
    pub ndts_rcv_probes_ucast: __u64,
    pub ndts_periodic_gc_runs: __u64,
    pub ndts_forced_gc_runs: __u64,
    pub ndts_table_fulls: __u64,
}
#[test]
fn bindgen_test_layout_ndt_stats() {
    assert_eq!(
        ::std::mem::size_of::<ndt_stats>(),
        88usize,
        concat!("Size of: ", stringify!(ndt_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<ndt_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(ndt_stats))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_allocs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_allocs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_destroys as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_destroys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_hash_grows as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_hash_grows)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_res_failed as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_res_failed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_lookups as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_lookups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_hits as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_hits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_rcv_probes_mcast as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_rcv_probes_mcast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_rcv_probes_ucast as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_rcv_probes_ucast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_periodic_gc_runs as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_periodic_gc_runs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_forced_gc_runs as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_forced_gc_runs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_stats>())).ndts_table_fulls as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_stats),
            "::",
            stringify!(ndts_table_fulls)
        )
    );
}
pub const NDTPA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NDTPA_IFINDEX: ::std::os::raw::c_uint = 1;
pub const NDTPA_REFCNT: ::std::os::raw::c_uint = 2;
pub const NDTPA_REACHABLE_TIME: ::std::os::raw::c_uint = 3;
pub const NDTPA_BASE_REACHABLE_TIME: ::std::os::raw::c_uint = 4;
pub const NDTPA_RETRANS_TIME: ::std::os::raw::c_uint = 5;
pub const NDTPA_GC_STALETIME: ::std::os::raw::c_uint = 6;
pub const NDTPA_DELAY_PROBE_TIME: ::std::os::raw::c_uint = 7;
pub const NDTPA_QUEUE_LEN: ::std::os::raw::c_uint = 8;
pub const NDTPA_APP_PROBES: ::std::os::raw::c_uint = 9;
pub const NDTPA_UCAST_PROBES: ::std::os::raw::c_uint = 10;
pub const NDTPA_MCAST_PROBES: ::std::os::raw::c_uint = 11;
pub const NDTPA_ANYCAST_DELAY: ::std::os::raw::c_uint = 12;
pub const NDTPA_PROXY_DELAY: ::std::os::raw::c_uint = 13;
pub const NDTPA_PROXY_QLEN: ::std::os::raw::c_uint = 14;
pub const NDTPA_LOCKTIME: ::std::os::raw::c_uint = 15;
pub const NDTPA_QUEUE_LENBYTES: ::std::os::raw::c_uint = 16;
pub const NDTPA_MCAST_REPROBES: ::std::os::raw::c_uint = 17;
pub const NDTPA_PAD: ::std::os::raw::c_uint = 18;
pub const __NDTPA_MAX: ::std::os::raw::c_uint = 19;
pub type _bindgen_ty_49 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndtmsg {
    pub ndtm_family: __u8,
    pub ndtm_pad1: __u8,
    pub ndtm_pad2: __u16,
}
#[test]
fn bindgen_test_layout_ndtmsg() {
    assert_eq!(
        ::std::mem::size_of::<ndtmsg>(),
        4usize,
        concat!("Size of: ", stringify!(ndtmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<ndtmsg>(),
        2usize,
        concat!("Alignment of ", stringify!(ndtmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndtmsg>())).ndtm_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ndtmsg),
            "::",
            stringify!(ndtm_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndtmsg>())).ndtm_pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ndtmsg),
            "::",
            stringify!(ndtm_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndtmsg>())).ndtm_pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ndtmsg),
            "::",
            stringify!(ndtm_pad2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ndt_config {
    pub ndtc_key_len: __u16,
    pub ndtc_entry_size: __u16,
    pub ndtc_entries: __u32,
    pub ndtc_last_flush: __u32,
    pub ndtc_last_rand: __u32,
    pub ndtc_hash_rnd: __u32,
    pub ndtc_hash_mask: __u32,
    pub ndtc_hash_chain_gc: __u32,
    pub ndtc_proxy_qlen: __u32,
}
#[test]
fn bindgen_test_layout_ndt_config() {
    assert_eq!(
        ::std::mem::size_of::<ndt_config>(),
        32usize,
        concat!("Size of: ", stringify!(ndt_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ndt_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ndt_config))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_key_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_key_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_entry_size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_entry_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_entries as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_entries)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_last_flush as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_last_flush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_last_rand as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_last_rand)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_hash_rnd as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_hash_rnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_hash_mask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_hash_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_hash_chain_gc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_hash_chain_gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ndt_config>())).ndtc_proxy_qlen as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ndt_config),
            "::",
            stringify!(ndtc_proxy_qlen)
        )
    );
}
pub const NDTA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NDTA_NAME: ::std::os::raw::c_uint = 1;
pub const NDTA_THRESH1: ::std::os::raw::c_uint = 2;
pub const NDTA_THRESH2: ::std::os::raw::c_uint = 3;
pub const NDTA_THRESH3: ::std::os::raw::c_uint = 4;
pub const NDTA_CONFIG: ::std::os::raw::c_uint = 5;
pub const NDTA_PARMS: ::std::os::raw::c_uint = 6;
pub const NDTA_STATS: ::std::os::raw::c_uint = 7;
pub const NDTA_GC_INTERVAL: ::std::os::raw::c_uint = 8;
pub const NDTA_PAD: ::std::os::raw::c_uint = 9;
pub const __NDTA_MAX: ::std::os::raw::c_uint = 10;
pub type _bindgen_ty_50 = ::std::os::raw::c_uint;
pub const FDB_NOTIFY_BIT: ::std::os::raw::c_uint = 1;
pub const FDB_NOTIFY_INACTIVE_BIT: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_51 = ::std::os::raw::c_uint;
pub const NFEA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NFEA_ACTIVITY_NOTIFY: ::std::os::raw::c_uint = 1;
pub const NFEA_DONT_REFRESH: ::std::os::raw::c_uint = 2;
pub const __NFEA_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_52 = ::std::os::raw::c_uint;
pub const RTM_BASE: ::std::os::raw::c_uint = 16;
pub const RTM_NEWLINK: ::std::os::raw::c_uint = 16;
pub const RTM_DELLINK: ::std::os::raw::c_uint = 17;
pub const RTM_GETLINK: ::std::os::raw::c_uint = 18;
pub const RTM_SETLINK: ::std::os::raw::c_uint = 19;
pub const RTM_NEWADDR: ::std::os::raw::c_uint = 20;
pub const RTM_DELADDR: ::std::os::raw::c_uint = 21;
pub const RTM_GETADDR: ::std::os::raw::c_uint = 22;
pub const RTM_NEWROUTE: ::std::os::raw::c_uint = 24;
pub const RTM_DELROUTE: ::std::os::raw::c_uint = 25;
pub const RTM_GETROUTE: ::std::os::raw::c_uint = 26;
pub const RTM_NEWNEIGH: ::std::os::raw::c_uint = 28;
pub const RTM_DELNEIGH: ::std::os::raw::c_uint = 29;
pub const RTM_GETNEIGH: ::std::os::raw::c_uint = 30;
pub const RTM_NEWRULE: ::std::os::raw::c_uint = 32;
pub const RTM_DELRULE: ::std::os::raw::c_uint = 33;
pub const RTM_GETRULE: ::std::os::raw::c_uint = 34;
pub const RTM_NEWQDISC: ::std::os::raw::c_uint = 36;
pub const RTM_DELQDISC: ::std::os::raw::c_uint = 37;
pub const RTM_GETQDISC: ::std::os::raw::c_uint = 38;
pub const RTM_NEWTCLASS: ::std::os::raw::c_uint = 40;
pub const RTM_DELTCLASS: ::std::os::raw::c_uint = 41;
pub const RTM_GETTCLASS: ::std::os::raw::c_uint = 42;
pub const RTM_NEWTFILTER: ::std::os::raw::c_uint = 44;
pub const RTM_DELTFILTER: ::std::os::raw::c_uint = 45;
pub const RTM_GETTFILTER: ::std::os::raw::c_uint = 46;
pub const RTM_NEWACTION: ::std::os::raw::c_uint = 48;
pub const RTM_DELACTION: ::std::os::raw::c_uint = 49;
pub const RTM_GETACTION: ::std::os::raw::c_uint = 50;
pub const RTM_NEWPREFIX: ::std::os::raw::c_uint = 52;
pub const RTM_GETMULTICAST: ::std::os::raw::c_uint = 58;
pub const RTM_GETANYCAST: ::std::os::raw::c_uint = 62;
pub const RTM_NEWNEIGHTBL: ::std::os::raw::c_uint = 64;
pub const RTM_GETNEIGHTBL: ::std::os::raw::c_uint = 66;
pub const RTM_SETNEIGHTBL: ::std::os::raw::c_uint = 67;
pub const RTM_NEWNDUSEROPT: ::std::os::raw::c_uint = 68;
pub const RTM_NEWADDRLABEL: ::std::os::raw::c_uint = 72;
pub const RTM_DELADDRLABEL: ::std::os::raw::c_uint = 73;
pub const RTM_GETADDRLABEL: ::std::os::raw::c_uint = 74;
pub const RTM_GETDCB: ::std::os::raw::c_uint = 78;
pub const RTM_SETDCB: ::std::os::raw::c_uint = 79;
pub const RTM_NEWNETCONF: ::std::os::raw::c_uint = 80;
pub const RTM_DELNETCONF: ::std::os::raw::c_uint = 81;
pub const RTM_GETNETCONF: ::std::os::raw::c_uint = 82;
pub const RTM_NEWMDB: ::std::os::raw::c_uint = 84;
pub const RTM_DELMDB: ::std::os::raw::c_uint = 85;
pub const RTM_GETMDB: ::std::os::raw::c_uint = 86;
pub const RTM_NEWNSID: ::std::os::raw::c_uint = 88;
pub const RTM_DELNSID: ::std::os::raw::c_uint = 89;
pub const RTM_GETNSID: ::std::os::raw::c_uint = 90;
pub const RTM_NEWSTATS: ::std::os::raw::c_uint = 92;
pub const RTM_GETSTATS: ::std::os::raw::c_uint = 94;
pub const RTM_NEWCACHEREPORT: ::std::os::raw::c_uint = 96;
pub const RTM_NEWCHAIN: ::std::os::raw::c_uint = 100;
pub const RTM_DELCHAIN: ::std::os::raw::c_uint = 101;
pub const RTM_GETCHAIN: ::std::os::raw::c_uint = 102;
pub const RTM_NEWNEXTHOP: ::std::os::raw::c_uint = 104;
pub const RTM_DELNEXTHOP: ::std::os::raw::c_uint = 105;
pub const RTM_GETNEXTHOP: ::std::os::raw::c_uint = 106;
pub const RTM_NEWLINKPROP: ::std::os::raw::c_uint = 108;
pub const RTM_DELLINKPROP: ::std::os::raw::c_uint = 109;
pub const RTM_GETLINKPROP: ::std::os::raw::c_uint = 110;
pub const RTM_NEWVLAN: ::std::os::raw::c_uint = 112;
pub const RTM_DELVLAN: ::std::os::raw::c_uint = 113;
pub const RTM_GETVLAN: ::std::os::raw::c_uint = 114;
pub const __RTM_MAX: ::std::os::raw::c_uint = 115;
#[doc = "\t\tRouting/neighbour discovery messages."]
pub type _bindgen_ty_53 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtattr {
    pub rta_len: ::std::os::raw::c_ushort,
    pub rta_type: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_rtattr() {
    assert_eq!(
        ::std::mem::size_of::<rtattr>(),
        4usize,
        concat!("Size of: ", stringify!(rtattr))
    );
    assert_eq!(
        ::std::mem::align_of::<rtattr>(),
        2usize,
        concat!("Alignment of ", stringify!(rtattr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtattr>())).rta_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtattr),
            "::",
            stringify!(rta_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtattr>())).rta_type as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rtattr),
            "::",
            stringify!(rta_type)
        )
    );
}
#[doc = "\t\tDefinitions used in routing table administration."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtmsg {
    pub rtm_family: ::std::os::raw::c_uchar,
    pub rtm_dst_len: ::std::os::raw::c_uchar,
    pub rtm_src_len: ::std::os::raw::c_uchar,
    pub rtm_tos: ::std::os::raw::c_uchar,
    pub rtm_table: ::std::os::raw::c_uchar,
    pub rtm_protocol: ::std::os::raw::c_uchar,
    pub rtm_scope: ::std::os::raw::c_uchar,
    pub rtm_type: ::std::os::raw::c_uchar,
    pub rtm_flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_rtmsg() {
    assert_eq!(
        ::std::mem::size_of::<rtmsg>(),
        12usize,
        concat!("Size of: ", stringify!(rtmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<rtmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(rtmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_dst_len as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_dst_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_src_len as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_src_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_tos as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_tos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_table as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_protocol as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_protocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_scope as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_type as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtmsg>())).rtm_flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rtmsg),
            "::",
            stringify!(rtm_flags)
        )
    );
}
pub const RTN_UNSPEC: ::std::os::raw::c_uint = 0;
pub const RTN_UNICAST: ::std::os::raw::c_uint = 1;
pub const RTN_LOCAL: ::std::os::raw::c_uint = 2;
pub const RTN_BROADCAST: ::std::os::raw::c_uint = 3;
pub const RTN_ANYCAST: ::std::os::raw::c_uint = 4;
pub const RTN_MULTICAST: ::std::os::raw::c_uint = 5;
pub const RTN_BLACKHOLE: ::std::os::raw::c_uint = 6;
pub const RTN_UNREACHABLE: ::std::os::raw::c_uint = 7;
pub const RTN_PROHIBIT: ::std::os::raw::c_uint = 8;
pub const RTN_THROW: ::std::os::raw::c_uint = 9;
pub const RTN_NAT: ::std::os::raw::c_uint = 10;
pub const RTN_XRESOLVE: ::std::os::raw::c_uint = 11;
pub const __RTN_MAX: ::std::os::raw::c_uint = 12;
pub type _bindgen_ty_54 = ::std::os::raw::c_uint;
pub const rt_scope_t_RT_SCOPE_UNIVERSE: rt_scope_t = 0;
pub const rt_scope_t_RT_SCOPE_SITE: rt_scope_t = 200;
pub const rt_scope_t_RT_SCOPE_LINK: rt_scope_t = 253;
pub const rt_scope_t_RT_SCOPE_HOST: rt_scope_t = 254;
pub const rt_scope_t_RT_SCOPE_NOWHERE: rt_scope_t = 255;
pub type rt_scope_t = ::std::os::raw::c_uint;
pub const rt_class_t_RT_TABLE_UNSPEC: rt_class_t = 0;
pub const rt_class_t_RT_TABLE_COMPAT: rt_class_t = 252;
pub const rt_class_t_RT_TABLE_DEFAULT: rt_class_t = 253;
pub const rt_class_t_RT_TABLE_MAIN: rt_class_t = 254;
pub const rt_class_t_RT_TABLE_LOCAL: rt_class_t = 255;
pub const rt_class_t_RT_TABLE_MAX: rt_class_t = 4294967295;
pub type rt_class_t = ::std::os::raw::c_uint;
pub const rtattr_type_t_RTA_UNSPEC: rtattr_type_t = 0;
pub const rtattr_type_t_RTA_DST: rtattr_type_t = 1;
pub const rtattr_type_t_RTA_SRC: rtattr_type_t = 2;
pub const rtattr_type_t_RTA_IIF: rtattr_type_t = 3;
pub const rtattr_type_t_RTA_OIF: rtattr_type_t = 4;
pub const rtattr_type_t_RTA_GATEWAY: rtattr_type_t = 5;
pub const rtattr_type_t_RTA_PRIORITY: rtattr_type_t = 6;
pub const rtattr_type_t_RTA_PREFSRC: rtattr_type_t = 7;
pub const rtattr_type_t_RTA_METRICS: rtattr_type_t = 8;
pub const rtattr_type_t_RTA_MULTIPATH: rtattr_type_t = 9;
pub const rtattr_type_t_RTA_PROTOINFO: rtattr_type_t = 10;
pub const rtattr_type_t_RTA_FLOW: rtattr_type_t = 11;
pub const rtattr_type_t_RTA_CACHEINFO: rtattr_type_t = 12;
pub const rtattr_type_t_RTA_SESSION: rtattr_type_t = 13;
pub const rtattr_type_t_RTA_MP_ALGO: rtattr_type_t = 14;
pub const rtattr_type_t_RTA_TABLE: rtattr_type_t = 15;
pub const rtattr_type_t_RTA_MARK: rtattr_type_t = 16;
pub const rtattr_type_t_RTA_MFC_STATS: rtattr_type_t = 17;
pub const rtattr_type_t_RTA_VIA: rtattr_type_t = 18;
pub const rtattr_type_t_RTA_NEWDST: rtattr_type_t = 19;
pub const rtattr_type_t_RTA_PREF: rtattr_type_t = 20;
pub const rtattr_type_t_RTA_ENCAP_TYPE: rtattr_type_t = 21;
pub const rtattr_type_t_RTA_ENCAP: rtattr_type_t = 22;
pub const rtattr_type_t_RTA_EXPIRES: rtattr_type_t = 23;
pub const rtattr_type_t_RTA_PAD: rtattr_type_t = 24;
pub const rtattr_type_t_RTA_UID: rtattr_type_t = 25;
pub const rtattr_type_t_RTA_TTL_PROPAGATE: rtattr_type_t = 26;
pub const rtattr_type_t_RTA_IP_PROTO: rtattr_type_t = 27;
pub const rtattr_type_t_RTA_SPORT: rtattr_type_t = 28;
pub const rtattr_type_t_RTA_DPORT: rtattr_type_t = 29;
pub const rtattr_type_t_RTA_NH_ID: rtattr_type_t = 30;
pub const rtattr_type_t___RTA_MAX: rtattr_type_t = 31;
pub type rtattr_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtnexthop {
    pub rtnh_len: ::std::os::raw::c_ushort,
    pub rtnh_flags: ::std::os::raw::c_uchar,
    pub rtnh_hops: ::std::os::raw::c_uchar,
    pub rtnh_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rtnexthop() {
    assert_eq!(
        ::std::mem::size_of::<rtnexthop>(),
        8usize,
        concat!("Size of: ", stringify!(rtnexthop))
    );
    assert_eq!(
        ::std::mem::align_of::<rtnexthop>(),
        4usize,
        concat!("Alignment of ", stringify!(rtnexthop))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnexthop>())).rtnh_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnexthop),
            "::",
            stringify!(rtnh_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnexthop>())).rtnh_flags as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnexthop),
            "::",
            stringify!(rtnh_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnexthop>())).rtnh_hops as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnexthop),
            "::",
            stringify!(rtnh_hops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtnexthop>())).rtnh_ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rtnexthop),
            "::",
            stringify!(rtnh_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct rtvia {
    pub rtvia_family: __kernel_sa_family_t,
    pub rtvia_addr: __IncompleteArrayField<__u8>,
}
#[test]
fn bindgen_test_layout_rtvia() {
    assert_eq!(
        ::std::mem::size_of::<rtvia>(),
        2usize,
        concat!("Size of: ", stringify!(rtvia))
    );
    assert_eq!(
        ::std::mem::align_of::<rtvia>(),
        2usize,
        concat!("Alignment of ", stringify!(rtvia))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtvia>())).rtvia_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtvia),
            "::",
            stringify!(rtvia_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtvia>())).rtvia_addr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rtvia),
            "::",
            stringify!(rtvia_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rta_cacheinfo {
    pub rta_clntref: __u32,
    pub rta_lastuse: __u32,
    pub rta_expires: __s32,
    pub rta_error: __u32,
    pub rta_used: __u32,
    pub rta_id: __u32,
    pub rta_ts: __u32,
    pub rta_tsage: __u32,
}
#[test]
fn bindgen_test_layout_rta_cacheinfo() {
    assert_eq!(
        ::std::mem::size_of::<rta_cacheinfo>(),
        32usize,
        concat!("Size of: ", stringify!(rta_cacheinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<rta_cacheinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(rta_cacheinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_clntref as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_clntref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_lastuse as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_lastuse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_expires as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_expires)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_error as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_used as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_id as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_ts as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_ts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_cacheinfo>())).rta_tsage as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_cacheinfo),
            "::",
            stringify!(rta_tsage)
        )
    );
}
pub const RTAX_UNSPEC: ::std::os::raw::c_uint = 0;
pub const RTAX_LOCK: ::std::os::raw::c_uint = 1;
pub const RTAX_MTU: ::std::os::raw::c_uint = 2;
pub const RTAX_WINDOW: ::std::os::raw::c_uint = 3;
pub const RTAX_RTT: ::std::os::raw::c_uint = 4;
pub const RTAX_RTTVAR: ::std::os::raw::c_uint = 5;
pub const RTAX_SSTHRESH: ::std::os::raw::c_uint = 6;
pub const RTAX_CWND: ::std::os::raw::c_uint = 7;
pub const RTAX_ADVMSS: ::std::os::raw::c_uint = 8;
pub const RTAX_REORDERING: ::std::os::raw::c_uint = 9;
pub const RTAX_HOPLIMIT: ::std::os::raw::c_uint = 10;
pub const RTAX_INITCWND: ::std::os::raw::c_uint = 11;
pub const RTAX_FEATURES: ::std::os::raw::c_uint = 12;
pub const RTAX_RTO_MIN: ::std::os::raw::c_uint = 13;
pub const RTAX_INITRWND: ::std::os::raw::c_uint = 14;
pub const RTAX_QUICKACK: ::std::os::raw::c_uint = 15;
pub const RTAX_CC_ALGO: ::std::os::raw::c_uint = 16;
pub const RTAX_FASTOPEN_NO_COOKIE: ::std::os::raw::c_uint = 17;
pub const __RTAX_MAX: ::std::os::raw::c_uint = 18;
pub type _bindgen_ty_55 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rta_session {
    pub proto: __u8,
    pub pad1: __u8,
    pub pad2: __u16,
    pub u: rta_session__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rta_session__bindgen_ty_1 {
    pub ports: rta_session__bindgen_ty_1__bindgen_ty_1,
    pub icmpt: rta_session__bindgen_ty_1__bindgen_ty_2,
    pub spi: __u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rta_session__bindgen_ty_1__bindgen_ty_1 {
    pub sport: __u16,
    pub dport: __u16,
}
#[test]
fn bindgen_test_layout_rta_session__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<rta_session__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rta_session__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rta_session__bindgen_ty_1__bindgen_ty_1>())).sport as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(sport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rta_session__bindgen_ty_1__bindgen_ty_1>())).dport as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(dport)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rta_session__bindgen_ty_1__bindgen_ty_2 {
    pub type_: __u8,
    pub code: __u8,
    pub ident: __u16,
}
#[test]
fn bindgen_test_layout_rta_session__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<rta_session__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rta_session__bindgen_ty_1__bindgen_ty_2>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rta_session__bindgen_ty_1__bindgen_ty_2>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rta_session__bindgen_ty_1__bindgen_ty_2>())).code as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rta_session__bindgen_ty_1__bindgen_ty_2>())).ident as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ident)
        )
    );
}
#[test]
fn bindgen_test_layout_rta_session__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<rta_session__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(rta_session__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rta_session__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rta_session__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session__bindgen_ty_1>())).ports as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1),
            "::",
            stringify!(ports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session__bindgen_ty_1>())).icmpt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1),
            "::",
            stringify!(icmpt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session__bindgen_ty_1>())).spi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session__bindgen_ty_1),
            "::",
            stringify!(spi)
        )
    );
}
#[test]
fn bindgen_test_layout_rta_session() {
    assert_eq!(
        ::std::mem::size_of::<rta_session>(),
        8usize,
        concat!("Size of: ", stringify!(rta_session))
    );
    assert_eq!(
        ::std::mem::align_of::<rta_session>(),
        4usize,
        concat!("Alignment of ", stringify!(rta_session))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session>())).proto as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session),
            "::",
            stringify!(proto)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session>())).pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session),
            "::",
            stringify!(pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session>())).pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_session>())).u as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_session),
            "::",
            stringify!(u)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rta_mfc_stats {
    pub mfcs_packets: __u64,
    pub mfcs_bytes: __u64,
    pub mfcs_wrong_if: __u64,
}
#[test]
fn bindgen_test_layout_rta_mfc_stats() {
    assert_eq!(
        ::std::mem::size_of::<rta_mfc_stats>(),
        24usize,
        concat!("Size of: ", stringify!(rta_mfc_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<rta_mfc_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(rta_mfc_stats))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_mfc_stats>())).mfcs_packets as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_mfc_stats),
            "::",
            stringify!(mfcs_packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_mfc_stats>())).mfcs_bytes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_mfc_stats),
            "::",
            stringify!(mfcs_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rta_mfc_stats>())).mfcs_wrong_if as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rta_mfc_stats),
            "::",
            stringify!(mfcs_wrong_if)
        )
    );
}
#[doc = "\t\tGeneral form of address family dependent message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtgenmsg {
    pub rtgen_family: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_rtgenmsg() {
    assert_eq!(
        ::std::mem::size_of::<rtgenmsg>(),
        1usize,
        concat!("Size of: ", stringify!(rtgenmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<rtgenmsg>(),
        1usize,
        concat!("Alignment of ", stringify!(rtgenmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rtgenmsg>())).rtgen_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rtgenmsg),
            "::",
            stringify!(rtgen_family)
        )
    );
}
#[doc = "\t\tLink layer specific messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifinfomsg {
    pub ifi_family: ::std::os::raw::c_uchar,
    pub __ifi_pad: ::std::os::raw::c_uchar,
    pub ifi_type: ::std::os::raw::c_ushort,
    pub ifi_index: ::std::os::raw::c_int,
    pub ifi_flags: ::std::os::raw::c_uint,
    pub ifi_change: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ifinfomsg() {
    assert_eq!(
        ::std::mem::size_of::<ifinfomsg>(),
        16usize,
        concat!("Size of: ", stringify!(ifinfomsg))
    );
    assert_eq!(
        ::std::mem::align_of::<ifinfomsg>(),
        4usize,
        concat!("Alignment of ", stringify!(ifinfomsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).ifi_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(ifi_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).__ifi_pad as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(__ifi_pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).ifi_type as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(ifi_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).ifi_index as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(ifi_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).ifi_flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(ifi_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ifinfomsg>())).ifi_change as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifinfomsg),
            "::",
            stringify!(ifi_change)
        )
    );
}
#[doc = "\t\tprefix information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prefixmsg {
    pub prefix_family: ::std::os::raw::c_uchar,
    pub prefix_pad1: ::std::os::raw::c_uchar,
    pub prefix_pad2: ::std::os::raw::c_ushort,
    pub prefix_ifindex: ::std::os::raw::c_int,
    pub prefix_type: ::std::os::raw::c_uchar,
    pub prefix_len: ::std::os::raw::c_uchar,
    pub prefix_flags: ::std::os::raw::c_uchar,
    pub prefix_pad3: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_prefixmsg() {
    assert_eq!(
        ::std::mem::size_of::<prefixmsg>(),
        12usize,
        concat!("Size of: ", stringify!(prefixmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<prefixmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(prefixmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_type as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_len as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_flags as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefixmsg>())).prefix_pad3 as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(prefixmsg),
            "::",
            stringify!(prefix_pad3)
        )
    );
}
pub const PREFIX_UNSPEC: ::std::os::raw::c_uint = 0;
pub const PREFIX_ADDRESS: ::std::os::raw::c_uint = 1;
pub const PREFIX_CACHEINFO: ::std::os::raw::c_uint = 2;
pub const __PREFIX_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_56 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prefix_cacheinfo {
    pub preferred_time: __u32,
    pub valid_time: __u32,
}
#[test]
fn bindgen_test_layout_prefix_cacheinfo() {
    assert_eq!(
        ::std::mem::size_of::<prefix_cacheinfo>(),
        8usize,
        concat!("Size of: ", stringify!(prefix_cacheinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<prefix_cacheinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(prefix_cacheinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefix_cacheinfo>())).preferred_time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(prefix_cacheinfo),
            "::",
            stringify!(preferred_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<prefix_cacheinfo>())).valid_time as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(prefix_cacheinfo),
            "::",
            stringify!(valid_time)
        )
    );
}
#[doc = "\t\tTraffic control messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tcmsg {
    pub tcm_family: ::std::os::raw::c_uchar,
    pub tcm__pad1: ::std::os::raw::c_uchar,
    pub tcm__pad2: ::std::os::raw::c_ushort,
    pub tcm_ifindex: ::std::os::raw::c_int,
    pub tcm_handle: __u32,
    pub tcm_parent: __u32,
    pub tcm_info: __u32,
}
#[test]
fn bindgen_test_layout_tcmsg() {
    assert_eq!(
        ::std::mem::size_of::<tcmsg>(),
        20usize,
        concat!("Size of: ", stringify!(tcmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<tcmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(tcmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm__pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm__pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm_ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm_parent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm_parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcmsg>())).tcm_info as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tcmsg),
            "::",
            stringify!(tcm_info)
        )
    );
}
pub const TCA_UNSPEC: ::std::os::raw::c_uint = 0;
pub const TCA_KIND: ::std::os::raw::c_uint = 1;
pub const TCA_OPTIONS: ::std::os::raw::c_uint = 2;
pub const TCA_STATS: ::std::os::raw::c_uint = 3;
pub const TCA_XSTATS: ::std::os::raw::c_uint = 4;
pub const TCA_RATE: ::std::os::raw::c_uint = 5;
pub const TCA_FCNT: ::std::os::raw::c_uint = 6;
pub const TCA_STATS2: ::std::os::raw::c_uint = 7;
pub const TCA_STAB: ::std::os::raw::c_uint = 8;
pub const TCA_PAD: ::std::os::raw::c_uint = 9;
pub const TCA_DUMP_INVISIBLE: ::std::os::raw::c_uint = 10;
pub const TCA_CHAIN: ::std::os::raw::c_uint = 11;
pub const TCA_HW_OFFLOAD: ::std::os::raw::c_uint = 12;
pub const TCA_INGRESS_BLOCK: ::std::os::raw::c_uint = 13;
pub const TCA_EGRESS_BLOCK: ::std::os::raw::c_uint = 14;
pub const TCA_DUMP_FLAGS: ::std::os::raw::c_uint = 15;
pub const __TCA_MAX: ::std::os::raw::c_uint = 16;
pub type _bindgen_ty_57 = ::std::os::raw::c_uint;
#[doc = "\t\tNeighbor Discovery userland options"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nduseroptmsg {
    pub nduseropt_family: ::std::os::raw::c_uchar,
    pub nduseropt_pad1: ::std::os::raw::c_uchar,
    pub nduseropt_opts_len: ::std::os::raw::c_ushort,
    pub nduseropt_ifindex: ::std::os::raw::c_int,
    pub nduseropt_icmp_type: __u8,
    pub nduseropt_icmp_code: __u8,
    pub nduseropt_pad2: ::std::os::raw::c_ushort,
    pub nduseropt_pad3: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_nduseroptmsg() {
    assert_eq!(
        ::std::mem::size_of::<nduseroptmsg>(),
        16usize,
        concat!("Size of: ", stringify!(nduseroptmsg))
    );
    assert_eq!(
        ::std::mem::align_of::<nduseroptmsg>(),
        4usize,
        concat!("Alignment of ", stringify!(nduseroptmsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_opts_len as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_opts_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_ifindex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_ifindex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_icmp_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_icmp_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_icmp_code as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_icmp_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_pad2 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nduseroptmsg>())).nduseropt_pad3 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nduseroptmsg),
            "::",
            stringify!(nduseropt_pad3)
        )
    );
}
pub const NDUSEROPT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NDUSEROPT_SRCADDR: ::std::os::raw::c_uint = 1;
pub const __NDUSEROPT_MAX: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_58 = ::std::os::raw::c_uint;
pub const rtnetlink_groups_RTNLGRP_NONE: rtnetlink_groups = 0;
pub const rtnetlink_groups_RTNLGRP_LINK: rtnetlink_groups = 1;
pub const rtnetlink_groups_RTNLGRP_NOTIFY: rtnetlink_groups = 2;
pub const rtnetlink_groups_RTNLGRP_NEIGH: rtnetlink_groups = 3;
pub const rtnetlink_groups_RTNLGRP_TC: rtnetlink_groups = 4;
pub const rtnetlink_groups_RTNLGRP_IPV4_IFADDR: rtnetlink_groups = 5;
pub const rtnetlink_groups_RTNLGRP_IPV4_MROUTE: rtnetlink_groups = 6;
pub const rtnetlink_groups_RTNLGRP_IPV4_ROUTE: rtnetlink_groups = 7;
pub const rtnetlink_groups_RTNLGRP_IPV4_RULE: rtnetlink_groups = 8;
pub const rtnetlink_groups_RTNLGRP_IPV6_IFADDR: rtnetlink_groups = 9;
pub const rtnetlink_groups_RTNLGRP_IPV6_MROUTE: rtnetlink_groups = 10;
pub const rtnetlink_groups_RTNLGRP_IPV6_ROUTE: rtnetlink_groups = 11;
pub const rtnetlink_groups_RTNLGRP_IPV6_IFINFO: rtnetlink_groups = 12;
pub const rtnetlink_groups_RTNLGRP_DECnet_IFADDR: rtnetlink_groups = 13;
pub const rtnetlink_groups_RTNLGRP_NOP2: rtnetlink_groups = 14;
pub const rtnetlink_groups_RTNLGRP_DECnet_ROUTE: rtnetlink_groups = 15;
pub const rtnetlink_groups_RTNLGRP_DECnet_RULE: rtnetlink_groups = 16;
pub const rtnetlink_groups_RTNLGRP_NOP4: rtnetlink_groups = 17;
pub const rtnetlink_groups_RTNLGRP_IPV6_PREFIX: rtnetlink_groups = 18;
pub const rtnetlink_groups_RTNLGRP_IPV6_RULE: rtnetlink_groups = 19;
pub const rtnetlink_groups_RTNLGRP_ND_USEROPT: rtnetlink_groups = 20;
pub const rtnetlink_groups_RTNLGRP_PHONET_IFADDR: rtnetlink_groups = 21;
pub const rtnetlink_groups_RTNLGRP_PHONET_ROUTE: rtnetlink_groups = 22;
pub const rtnetlink_groups_RTNLGRP_DCB: rtnetlink_groups = 23;
pub const rtnetlink_groups_RTNLGRP_IPV4_NETCONF: rtnetlink_groups = 24;
pub const rtnetlink_groups_RTNLGRP_IPV6_NETCONF: rtnetlink_groups = 25;
pub const rtnetlink_groups_RTNLGRP_MDB: rtnetlink_groups = 26;
pub const rtnetlink_groups_RTNLGRP_MPLS_ROUTE: rtnetlink_groups = 27;
pub const rtnetlink_groups_RTNLGRP_NSID: rtnetlink_groups = 28;
pub const rtnetlink_groups_RTNLGRP_MPLS_NETCONF: rtnetlink_groups = 29;
pub const rtnetlink_groups_RTNLGRP_IPV4_MROUTE_R: rtnetlink_groups = 30;
pub const rtnetlink_groups_RTNLGRP_IPV6_MROUTE_R: rtnetlink_groups = 31;
pub const rtnetlink_groups_RTNLGRP_NEXTHOP: rtnetlink_groups = 32;
pub const rtnetlink_groups_RTNLGRP_BRVLAN: rtnetlink_groups = 33;
pub const rtnetlink_groups___RTNLGRP_MAX: rtnetlink_groups = 34;
pub type rtnetlink_groups = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tcamsg {
    pub tca_family: ::std::os::raw::c_uchar,
    pub tca__pad1: ::std::os::raw::c_uchar,
    pub tca__pad2: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_tcamsg() {
    assert_eq!(
        ::std::mem::size_of::<tcamsg>(),
        4usize,
        concat!("Size of: ", stringify!(tcamsg))
    );
    assert_eq!(
        ::std::mem::align_of::<tcamsg>(),
        2usize,
        concat!("Alignment of ", stringify!(tcamsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcamsg>())).tca_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tcamsg),
            "::",
            stringify!(tca_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcamsg>())).tca__pad1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tcamsg),
            "::",
            stringify!(tca__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tcamsg>())).tca__pad2 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tcamsg),
            "::",
            stringify!(tca__pad2)
        )
    );
}
pub const TCA_ROOT_UNSPEC: ::std::os::raw::c_uint = 0;
pub const TCA_ROOT_TAB: ::std::os::raw::c_uint = 1;
pub const TCA_ROOT_FLAGS: ::std::os::raw::c_uint = 2;
pub const TCA_ROOT_COUNT: ::std::os::raw::c_uint = 3;
pub const TCA_ROOT_TIME_DELTA: ::std::os::raw::c_uint = 4;
pub const __TCA_ROOT_MAX: ::std::os::raw::c_uint = 5;
pub type _bindgen_ty_59 = ::std::os::raw::c_uint;
